{
	"optionalfeature": [
		{"name":"Careful Spell","entries":["When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell."],"source":"PHEW","featureType":"MM"},
		{"name":"Distant Spell","entries":["When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell.","When you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet."],"source":"PHEW","featureType":"MM"},
		{"name":"Empowered Spell","entries":["When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.","You can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell."],"source":"PHEW","featureType":"MM"},
		{"name":"Extended Spell","entries":["When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to increase its duration as explained in the follwing table, to a maximum duration of 24 hours.",{"type": "table","caption": "Extended Spell Durations","colLabels": ["Spell Duration","Extended Spell Duration"],"colStyles": ["col-6 text-center","col-6 text-center"],"rows": [["1 minute","10 minutes"],["10 minutes","1 hour"],["1 hour","8 hours"],["8 hours","24 hours"]]}],"source":"PHEW","featureType":"MM"},
		{"name":"Heightened Spell","entries":["When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell."],"source":"PHEW","featureType":"MM"},
		{"name":"Quickened Spell","entries":["When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting."],"source":"PHEW","featureType":"MM"},
		{"name":"Subtle Spell","entries":["When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components."],"source":"PHEW","featureType":"MM"},
		{"name":"Twinned Spell","entries":["When you cast a spell that doesn't have a range of self and is incapable of targeting more than one creature at the spell's current level, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip).","To be eligible, a spell must be incapable of targeting more than one creature at the spell's current level. For example, magic missile and scorching ray aren't eligible, but ray of frost and chromatic orb are."],"source":"PHEW","featureType":"MM"},
		{"name":"Elemental Spell","entries":["When you cast a spell that deals a type of damage from the following list, you can spend 1 sorcery point to change that damage type to one of the other listed types: acid, cold, fire, lightning, thunder."],"source":"PHEW","featureType":"MM"},
		{"name":"Seeking Spell","entries":["When you cast a spell that requires you to make a spell attack roll or that forces a target to make a Dexterity saving throw, you can spend 1 sorcery point to ignore the effects of half- and three-quarters cover against targets of the spell."],"source":"PHEW","featureType":"MM"},
		{"name":"Unerring Spell","entries":["If you make an attack roll for a spell and miss, you can spend 2 sorcery points to reroll the attack roll. You must use the result of the second roll.","You can use Unerring Spell even if you have already used a different Metamagic option during the casting of the spell."],"source":"PHEW","featureType":"MM"},
		{"name":"Commander's Strike","entries":["When you take the Attack action on your turn, you can forgo one of your attacks and use a bonus action to direct one of your companions to strike. When you do so, choose a friendly creature who can see or hear you and expend one superiority die. That creature can immediately use its reaction to make one weapon attack, adding the superiority die to the attack's damage roll."],"featureType":"MV","source":"PHEW"},
		{"name":"Disarming Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to attempt to disarm the target, forcing it to drop one item of your choice that it's holding. You add the superiority die to the attack's damage roll, and the target must make a Strength saving throw. On a failed save, it drops the object you choose. The object lands at its feet."],"featureType":"MV","source":"PHEW"},
		{"name":"Distracting Strike","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to distract the creature, giving your allies an opening. You add the superiority die to the attack's damage roll. The next attack roll against the target by an attacker other than you has advantage if the attack is made before the start of your next turn."],"featureType":"MV","source":"PHEW"},
		{"name":"Evasive Footwork","entries":["When you move, you can expend one superiority die, rolling the die and adding the number rolled to your AC until you stop moving."],"featureType":"MV","source":"PHEW"},
		{"name":"Feinting Attack","entries":["You can expend one superiority die and use a bonus action on your turn to feint, choosing one creature within 5 feet of you as your target. You have advantage on your next attack roll this turn against that creature. If that attack hits, add the superiority die to the attack's damage roll.","The advantage is lost if not used on the turn you gain it."],"featureType":"MV","source":"PHEW"},
		{"name":"Goading Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to attempt to goad the target into attacking you. You add the superiority die to the attack's damage roll, and the target must make a Wisdom saving throw. On a failed save, the target has disadvantage on all attack rolls against targets other than you until the end of your next turn."],"featureType":"MV","source":"PHEW"},
		{"name":"Lunging Attack","entries":["When you make a melee weapon attack on your turn, you can expend one superiority die to increase your reach for that attack by 5 feet. If you hit, you add the superiority die to the attack's damage roll."],"featureType":"MV","source":"PHEW"},
		{"name":"Maneuvering Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to maneuver one of your comrades into a more advantageous position. You add the superiority die to the attack's damage roll, and you choose a friendly creature who can see or hear you. That creature can use its reaction to move up to half its speed without provoking opportunity attacks from the target of your attack."],"featureType":"MV","source":"PHEW"},
		{"name":"Menacing Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to attempt to frighten the target. You add the superiority die to the attack's damage roll, and the target must make a Wisdom saving throw. On a failed save, it is {@condition frightened|phew} of you until the end of your next turn."],"featureType":"MV","source":"PHEW"},
		{"name":"Parry","entries":["When another creature damages you with a melee attack, you can use your reaction and expend one superiority die to reduce the damage by the number you roll on your superiority die + your Dexterity modifier."],"featureType":"MV","source":"PHEW"},
		{"name":"Precision Attack","entries":["When you make a weapon attack roll against a creature, you can expend one superiority die to add it to the roll. You can use this maneuver before or after making the attack roll, but before any effects of the attack are applied."],"featureType":"MV","source":"PHEW"},
		{"name":"Pushing Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to attempt to drive the target back. You add the superiority die to the attack's damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you push the target up to 15 feet away from you."],"featureType":"MV","source":"PHEW"},
		{"name":"Rally","entries":["On your turn, you can use a bonus action and expend one superiority die to bolster the resolve of one of your companions. When you do so, choose a friendly creature who can see or hear you. That creature gains temporary hit points equal to the superiority die roll + your Charisma modifier."],"featureType":"MV","source":"PHEW"},
		{"name":"Riposte","entries":["When a creature misses you with a melee attack, you can use your reaction and expend one superiority die to make a melee weapon attack against the creature. If you hit, you add the superiority die to the attack's damage roll."],"featureType":"MV","source":"PHEW"},
		{"name":"Sweeping Attack","entries":["When you hit a creature with a melee weapon attack, you can expend one superiority die to attempt to damage another creature with the same attack. Choose another creature within 5 feet of the original target and within your reach. If the original attack roll would hit the second creature, it takes damage equal to the number you roll on your superiority die. The damage is of the same type dealt by the original attack."],"featureType":"MV","source":"PHEW"},
		{"name":"Trip Attack","entries":["When you hit a creature with a weapon attack, you can expend one superiority die to attempt to knock the target down. You add the superiority die to the attack's damage roll, and if the target is Large or smaller, it must make a Strength saving throw. On a failed save, you knock the target {@condition prone|phew}."],"featureType":"MV","source":"PHEW"},
		{"name":"Archery","entries":["You gain a +2 bonus to attack rolls you make with ranged weapons."],"source":"PHEW","featureType":["FS:F","FS:R"]},
		{"name":"Defense","entries":["While you are wearing armor, you gain a +1 bonus to AC."],"source":"PHEW","featureType":["FS:F","FS:P","FS:R"]},
		{"name":"Dueling","entries":["When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."],"source":"PHEW","featureType":["FS:F","FS:B","FS:P","FS:R"]},
		{"name":"Great Weapon Fighting","entries":["When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit."],"source":"PHEW","featureType":["FS:F","FS:P"]},
		{"name":"Protection","entries":["When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield."],"source":"PHEW","featureType":["FS:F","FS:P"]},
		{"name":"Two-Weapon Fighting","entries":["When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."],"source":"PHEW","featureType":["FS:F","FS:B","FS:R"]},
		{"name":"Banishing Arrow","entries":["You use abjuration magic to try to temporarily banish your target to a harmless location in the Feywild. The creature hit by the arrow must also succeed on a Charisma saving throw or be banished. While banished in this way, the target's speed is 0, and it is {@condition incapacitated|phew}. At the end of its next turn, the target reappears in the space it vacated or in the nearest unoccupied space if that space is occupied.","After you reach 18th level in this class, a target also takes {@dice 2d6} force damage when the arrow hits it."],"featureType":"AS","source":"PHEW"},
		{"name":"Beguiling Arrow","entries":["Your enchantment magic causes this arrow to temporarily beguile its target. The creature hit by the arrow takes an extra {@dice 2d6} psychic damage, and choose one of your allies within 30 feet of the target. The target must succeed on a Wisdom saving throw, or it is {@condition charmed|phew} by the chosen ally until the start of your next turn. This effect ends early if the chosen ally attacks the {@condition charmed|phew} target, deals damage to it, or forces it to make a saving throw.","The psychic damage increases to {@dice 4d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Bursting Arrow","entries":["You imbue your arrow with force energy drawn from the school of evocation. The energy detonates after your attack. Immediately after the arrow hits the creature, the target and all other creatures within 10 feet of it take {@dice 2d6} force damage each.","The force damage increases to {@dice 4d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Enfeebling Arrow","entries":["You weave necromantic magic into your arrow. The creature hit by the arrow takes an extra {@dice 2d6} necrotic damage. The target must also succeed on a Constitution saving throw, or the damage dealt by its weapon attacks is halved until the start of your next turn.","The necrotic damage increases to {@dice 4d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Grasping Arrow","entries":["When this arrow strikes its target, conjuration magic creates grasping, poisonous brambles, which wrap around the target. The creature hit by the arrow takes an extra {@dice 2d6} poison damage, its speed is reduced by 10 feet, and it takes {@dice 2d6} slashing damage the first time on each turn it moves 1 foot or more without teleporting. The target or any creature that can reach it can use its action to remove the brambles with a successful Strength (Athletics) check against your Arcane Shot save DC. Otherwise, the brambles last for 1 minute or until you use this option again.","The poison damage and slashing damage both increase to {@dice 4d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Piercing Arrow","entries":["You use transmutation magic to give your arrow an ethereal quality. When you use this option, you don't make an attack roll for the attack. Instead, the arrow shoots forward in a line, which is 1 foot wide and 30 feet long, before disappearing. The arrow passes harmlessly through objects, ignoring cover. Each creature in that line must make a Dexterity saving throw. On a failed save, a creature takes damage as if it were hit by the arrow, plus an extra {@dice 1d6} piercing damage. On a successful save, a target takes half as much damage.","The piercing damage increases to {@dice 2d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Seeking Arrow","entries":["Using divination magic, you grant your arrow the ability to seek out a target. When you use this option, you don't make an attack roll for the attack. Instead, choose one creature you have seen in the past minute. The arrow flies toward that creature, moving around corners if necessary and ignoring three-quarters cover and half cover. If the target is within the weapon's range and there is a path large enough for the arrow to travel to the target, the target must make a Dexterity saving throw. Otherwise, the arrow disappears after traveling as far as it can. On a failed save, the target takes damage as if it were hit by the arrow, plus an extra {@dice 1d6} force damage, and you learn the target's current location. On a successful save, the target takes half as much damage, and you don't learn its location.","The force damage increases to {@dice 2d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Shadow Arrow","entries":["You weave illusion magic into your arrow, causing it to occlude your foe's vision with shadows. The creature hit by the arrow takes an extra {@dice 2d6} psychic damage, and it must succeed on a Wisdom saving throw or be unable to see anything farther than 5 feet away until the start of your next turn.","The psychic damage increases to {@dice 4d6} when you reach 18th level in this class."],"featureType":"AS","source":"PHEW"},
		{"name":"Ambush","entries":["When you make a Dexterity (Stealth) check or an initiative roll, you can expend one superiority die and add the die to the roll."],"source":"PHEW","featureType":"MV"},
		{"name":"Bait and Switch","entries":["When you're within 5 feet of an ally on your turn, you can expend one superiority die and switch places with that ally, provided you spend at least 5 feet of movement. This movement doesn't provoke opportunity attacks.","Roll the superiority die. Until the start of your next turn, the ally gains a bonus to AC equal to the number rolled."],"source":"PHEW","featureType":"MV"},
		{"name":"Brace","entries":["When an enemy you can see moves within 5 feet of you, you can use your reaction to expend one superiority die and make one weapon attack against that creature. If the attack hits, add the superiority die to the attack's damage roll."],"source":"PHEW","featureType":"MV"},
		{"name":"Restraining Strike","entries":["Immediately after you hit a creature with a melee weapon attack on your turn, you can expend one superiority die and use a bonus action to grapple the target (see chapter 9 in the Player's Handbook for rules on grappling). Add the superiority die to your Strength (Athletics) check. The target is also restrained while grappled in this way."],"source":"PHEW","featureType":"MV"},
		{"name":"Silver Tongue","entries":["When you make a Charisma (Deception) check or a Charisma (Persuasion) check, you can expend one superiority die, and add the superiority die to the ability check."],"source":"PHEW","featureType":"MV"},
		{"name":"Snipe","entries":["As a bonus action, you can expend one superiority die and make a ranged weapon attack. You can draw a thrown weapon as part of making this attack. If you hit, add the superiority die to the attack's damage roll."],"source":"PHEW","featureType":"MV"},
		{"name":"Studious Eye","entries":["When you make a Wisdom (Insight) check or an Intelligence (Investigation) check, you can expend one superiority die, and add the superiority die to the ability check."],"source":"PHEW","featureType":"MV"},
		{"name":"Blind Fighting","entries":["Being unable to see a creature doesn't impose disadvantage on your attack rolls against it, provided the creature isn't hidden from you."],"source":"PHEW","featureType":["FS:F","FS:P","FS:R"]},
		{"name":"Interception","entries":["When a creature you can see hits a target that is within 5 feet of you with an attack, you can use your reaction to reduce the damage the target takes by {@dice 1d10} + your proficiency bonus (to a minimum of 0 damage). You must be wielding a shield or a simple or martial weapon to use this reaction."],"source":"PHEW","featureType":["FS:F","FS:P","FS:R"]},
		{"name":"Thrown Weapon Fighting","entries":["You can draw a weapon that has the thrown property as part of the attack you make with the weapon.","In addition, when you hit with a ranged attack using a thrown weapon, you gain a +1 bonus to the damage roll."],"source":"PHEW","featureType":["FS:F","FS:P","FS:R"]},
		{"name":"Unarmed Fighting","entries":["Your unarmed strikes can deal bludgeoning damage equal to {@dice 1d6} + your Strength modifier. If you strike with two free hands, the {@dice d6} becomes a {@dice d8}.","When you successfully start a grapple, you can deal {@dice 1d4} bludgeoning damage to the grappled creature. Until the grapple ends, you can also deal this damage to the creature whenever you hit it with a melee attack."],"source":"PHEW","featureType":["FS:F","FS:P","FS:R"]},
		{"name":"Superior Technique","entries":["You learn one {@filter maneuver|optionalfeatures|feature type=MV;MV} of your choice from among those available to the Battle Master archetype. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).","You gain one superiority die, which is a {@dice d6} (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest."],"source":"PHEW","featureType":["FS:F"]},
		{"name":"Blessed Warrior","entries":["You learn two cantrips of your choice from the cleric spell list. They count as paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the cleric spell list."],"source":"PHEW","featureType":["FS:P"]},
		{"name":"Druidic Warrior","entries":["You learn two cantrips of your choice from the {@filter druid spell list|spells|level=0|class=druid}. They count as druid spells for you, and Wisdom is your spellcasting ability for them. Whenever you gain a level in this class, you can replace one of these cantrips with another cantrip from the druid spell list."],"source":"PHEW","featureType":["FS:R"]},
		{"name":"Pact of the Chain","entries":["Your patron felt the need to provide a guide, watcher, or aide. You learn the {@spell find familiar|PHEW} spell and can cast it as a ritual. The spell doesn't count against your number of spells known.","When you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: {@creature imp|PHEW}, {@creature pseudodragon|PHEW}, {@creature quasit|PHEW}, or {@creature sprite|PHEW}.","Additionally, when you take the {@action Attack|PHEW} action, you can forgo one of your own attacks to allow your familiar to use its reaction to make one attack of its own.","Your familiar uses your proficiency bonus instead of its own, and has proficiency in all saving throws. It adds your proficiency bonus to its AC and attack damage, and its hit point maximum increases by twice your warlock level."],"featureType":"PB","source":"PHEW"},
		{"name":"Pact of the Blade","entries":["Your patron required a warrior. You become proficient with martial weapons, medium armor, and shields.","You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it (see chapter 5 for weapon options). This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage. You can use this weapon as an arcane focus for your warlock spells.","Your pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.","You can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks."],"featureType":"PB","source":"PHEW"},
		{"name":"Pact of the Tome","entries":["Your patron grants you the gift of knowledge, in the form of an otherworldly grimoire, tablet, or scroll. This tome acts as a warlock spellcasting focus. You can use it to cast warlock spells you know as rituals, if they have the ritual tag.","You can also inscribe magical rituals in this tome. Choose two 1st-level spells that have the ritual tag from any class’s spell list. The spells appear in the tome, and are treated as warlock spells you know. They don’t count against the number of spells you know, and you can’t cast the spells except as rituals, unless you’ve learned them by other means.","If you find other ritual spells recorded in spellbooks or spell scrolls, you can add them to the book if the spell’s level is equal to or less than half your warlock level (rounded up), in the same way as a wizard adding a spell to their spellbook.","If you lose your tome, you can perform a 1-hour ceremony to create a replacement. This ceremony can be performed during a short or long rest, and it destroys the previous tome. The tome turns to ash when you die."],"featureType":"PB","source":"PHEW"},
		{"featureType":"ED","name":"Breath of Winter","prerequisite":[{"level":{"level":17,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 5 ki points to cast {@spell cone of cold|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Clench of the North Wind","prerequisite":[{"level":{"level":6,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 2 ki points to cast {@spell hold person|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Elemental Attunement","entries":["You can use your action to briefly control elemental forces within 30 feet of you, causing one of the following effects of your choice:",{"type":"list","items":["Create a harmless, instantaneous sensory effect related to air, earth, fire, or water, such as a shower of sparks, a puff of wind, a spray of light mist, or a gentle rumbling of stone.","Instantaneously light or snuff out a candle, a torch, or a small campfire.","Chill or warm up to 1 pound of nonliving material for up to 1 hour.","Cause earth, fire, water, or mist that can fit within a 1-foot cube to shape itself into a crude form you designate for 1 minute."]}],"source":"PHEW"},
		{"featureType":"ED","name":"Eternal Mountain Defense","prerequisite":[{"level":{"level":17,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 4 ki points to cast {@spell stoneskin|phew}, targeting yourself."],"source":"PHEW"},
		{"featureType":"ED","name":"Fangs of the Fire Snake","entries":["When you use the {@action Attack|phew} action on your turn, you can spend 1 ki point to cause tendrils of flame to stretch out from your fists and feet. Your reach with your unarmed strikes increases by 10 feet for that action, as well as the rest of the turn. A hit with such an attack deals fire damage instead of bludgeoning damage, and if you spend 1 ki point when the attack hits, it also deals an extra {@dice 1d10} fire damage."],"source":"PHEW"},
		{"featureType":"ED","name":"Fist of Four Thunders","entries":["You can spend 1 ki points to cast {@spell thunderwave|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Unbroken Air","entries":["You can create a blast of compressed air that strikes like a mighty fist. As an action, you can spend 2 ki points and choose a creature within 30 feet of you. That creature must make a Strength saving throw. On a failed save, the creature takes {@dice 3d10} bludgeoning damage, plus an extra {@dice 1d10} bludgeoning damage for each additional ki point you spend, and you can push the creature up to 20 feet away from you and knock it {@condition prone|phew}. On a successful save, the creature takes half as much damage, and you don't push it or knock it {@condition prone|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Flames of the Phoenix","prerequisite":[{"level":{"level":11,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 3 ki points to cast {@spell fireball|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Gong of the Summit","prerequisite":[{"level":{"level":6,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 2 ki points to cast {@spell shatter|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Mist Stance","prerequisite":[{"level":{"level":11,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 3 ki points to cast {@spell gaseous form|phew}, targeting yourself."],"source":"PHEW"},
		{"featureType":"ED","name":"Ride the Wind","prerequisite":[{"level":{"level":11,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 3 ki points to cast {@spell fly|phew}, targeting yourself."],"source":"PHEW"},
		{"featureType":"ED","name":"River of Hungry Flame","prerequisite":[{"level":{"level":17,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 4 ki points to cast {@spell wall of fire|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Rush of the Gale Spirits","entries":["You can spend 1 ki points to cast {@spell gust of wind|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Shape the Flowing River","entries":["As an action, you can spend 1 ki point to choose an area of ice or water no larger than 30 feet on a side within 120 feet of you. You can change water to ice within the area and vice versa, and you can reshape ice in the area in any manner you choose. You can raise or lower the ice's elevation, create or fill in a trench, erect or flatten a wall, or form a pillar. The extent of any such changes can't exceed half the area's largest dimension. For example, if you affect a 30-foot square, you can create a pillar up to 15 feet high. raise or lower the square's elevation by up to 15 feet, dig a trench up to 15 feet deep, and so on. You can't shape the ice to trap or injure a creature in the area."],"source":"PHEW"},
		{"featureType":"ED","name":"Sweeping Cinder Strike","entries":["You can spend 1 ki points to cast {@spell burning hands|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Water Whip","entries":["You can spend 2 ki points as an action to create a whip of water that shoves and pulls a creature to unbalance it. A creature that you can see that is within 30 feet of you must make a Dexterity saving throw. On a failed save, the creature takes {@dice 3d10} bludgeoning damage, plus an extra {@dice 1d10} bludgeoning damage for each additional ki point you spend, and you can either knock it {@condition prone|phew} or pull it up to 25 feet closer to you. On a successful save, the creature takes half as much damage, and you don't pull it or knock it {@condition prone|phew}."],"source":"PHEW"},
		{"featureType":"ED","name":"Wave of Rolling Earth","prerequisite":[{"level":{"level":17,"class":{"name":"Monk"},"subclass":{"name":"Four Elements"}}}],"entries":["You can spend 5 ki points to cast {@spell wall of stone|phew}."],"source":"PHEW"},
		{"name":"Boots of the Winding Path","prerequisite":[{"level":{"level":6,"class":{"name":"Artificer"}},"item":["A pair of boots (requires attunement)"]}],"entries":["While wearing these boots, a creature can teleport up to 15 feet as a bonus action to an unoccupied space the creature can see. The creature must have occupied that space at some point during the current turn."],"source":"PHEW","featureType":"AI"},
		{"name":"Enhanced Arcane Focus","prerequisite":[{"item":["A rod, staff, or wand (requires attunement)"]}],"entries":["While holding this item, a creature gains a +1 bonus to spell attack rolls. In addition, the creature ignores half cover when making a spell attack.","The bonus increases to +2 when you reach 10th level in this class."],"source":"PHEW","featureType":"AI"},
		{"name":"Enhanced Defense","prerequisite":[{"item":["A suit of armor or a shield"]}],"entries":["A creature gains a +1 bonus to Armor Class while wearing (armor) or wielding (shield) the infused item.","The bonus increases to +2 when you reach 10th level in this class."],"source":"PHEW","featureType":"AI"},
		{"name":"Enhanced Weapon","prerequisite":[{"item":["A simple or martial weapon"]}],"entries":["This magic weapon grants a +1 bonus to attack and damage rolls made with it.","The bonus increases to +2 when you reach 10th level in this class."],"source":"PHEW","featureType":"AI"},
		{"name":"Homunculus Servant","prerequisite":[{"level":{"level":6,"class":{"name":"Artificer"}},"item":["A gem worth at least 100 gp or a dragonshard"]}],"entries":["You learn intricate methods for magically creating a special {@creature Homunculus Servant|PHEW|homunculus} that serves you. The item you infuse serves as the creature's heart, around which the creature's body instantly forms.","You determine the homunculus's appearance. Some artificers prefer mechanical-looking birds, whereas some like winged vials or miniature, animate cauldrons.","The homunculus is friendly to you and your companions, and it obeys your commands. See this creature's game statistics in the Homunculus Servant stat block.","In combat, the homunculus shares your initiative count, but it takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes on its turn is the {@action Dodge|PHEW} action, unless you take a bonus action on your turn to command it to take the action in its stat block or the {@action Dash|PHEW}, {@action Disengage|PHEW}, {@action Help|PHEW}, {@action Hide|PHEW}, or {@action Search|PHEW} action.","The homunculus regains {@dice 2d6} hit points if the {@spell mending|PHEW} spell is cast on it. If it dies, it vanishes, leaving its heart in its space."],"source":"PHEW","featureType":"AI"},
		{"name":"Radiant Weapon","prerequisite":[{"level":{"level":6,"class":{"name":"Artificer"}},"item":["A simple or martial weapon (requires attunement)"]}],"entries":["This magic weapon grants a +1 bonus to attack and damage rolls made with it. While holding it, the wielder can take a bonus action to cause it to shed bright light in a 30-foot radius and dim light for an additional 30 feet. The wielder can extinguish the light as a bonus action.","The weapon has 4 charges. As a reaction immediately after being hit by an attack, the wielder can expend 1 charge and cause the attacker to be {@condition blinded|PHEW} until the end of the attacker's next turn, unless the attacker succeeds on a Constitution saving throw against your spell save DC. The weapon regains {@dice 1d4} expended charges daily at dawn."],"source":"PHEW","featureType":"AI"},
		{"name":"Repeating Shot","prerequisite":[{"item":["A simple or martial weapon with the ammunition property (requires attunement)"]}],"entries":["This magic weapon grants a +1 bonus to attack and damage rolls made with it when it's used to make a ranged attack, and it ignores the loading property if it has it.","If you load no ammunition in the weapon, it produces its own, automatically creating one piece of magic ammunition when you make a ranged attack with it. The ammunition created by the weapon vanishes the instant after it hits or misses a target."],"source":"PHEW","featureType":"AI"},
		{"name":"Replicate Magic Item","entries":["Using this infusion, you replicate a particular magic item. You can learn this infusion multiple times; each time you do so, choose a magic item that you can make with it, picking from the Replicable Items tables below. A table's title tells you the level you must be in the class to choose an item from the table.","In the tables, an item's entry tells you whether the item requires attunement. See the item's description in the {@book Dungeon Master's Guide|DMG} for more information about it, including the type of object required for its making.","If you have {@book Xanathar's Guide to Everything|XGE}, you can choose from among the common magic items in that book when you pick a magic item you can replicate with this infusion.",{"type":"table","caption":"Replicable Items (2nd-Level Artificer)","colLabels":["Magic Item","Attunement"],"colStyles":["col-10","col-2 text-center"],"rows":[["{@item Armblade|PHEW}","Yes"],["{@item Bag of holding|PHEW}","No"],["{@item Cap of water breathing|PHEW}","No"],["{@item Goggles of night|PHEW}","No"],["{@item Prosthetic limb|PHEW}","Yes"],["{@item Rope of climbing|PHEW}","No"],["{@item Sending stones|PHEW}","No"],["{@item Wand of magic detection|PHEW}","No"],["{@item Wand of secrets|PHEW}","No"]]},{"type":"table","caption":"Replicable Items (6th-Level Artificer)","colLabels":["Magic Item","Attunement"],"colStyles":["col-10","col-2 text-center"],"rows":[["{@item Boots of elvenkind|PHEW}","No"],["{@item Cloak of elvenkind|PHEW}","Yes"],["{@item Cloak of the manta ray|PHEW}","No"],["{@item Eyes of charming|PHEW}","Yes"],["{@item Gloves of thievery|PHEW}","No"],["{@item Lantern of revealing|PHEW}","No"],["{@item Pipes of haunting|PHEW}","No"],["{@item Ring of water walking|PHEW}","No"],["{@item Wand sheath|PHEW}","Yes"]]},{"type":"table","caption":"Replicable Items (10th-Level Artificer)","colLabels":["Magic Item","Attunement"],"colStyles":["col-11","col-2 text-center"],"rows":[["{@item Boots of striding and springing|PHEW}","Yes"],["{@item Boots of the winterlands|PHEW}","Yes"],["{@item Bracers of archery|PHEW}","Yes"],["{@item Brooch of shielding|PHEW}","Yes"],["{@item Cloak of protection|PHEW}","Yes"],["{@item Eyes of the eagle|PHEW}","Yes"],["{@item Gloves of missile snaring|PHEW}","Yes"],["{@item Gloves of swimming and climbing|PHEW}","Yes"],["{@item Hat of disguise|PHEW}","Yes"],["{@item Headband of intellect|PHEW}","Yes"],["{@item Helm of telepathy|PHEW}","Yes"],["{@item Medallion of thoughts|PHEW}","Yes"],["{@item Periapt of wound closure|PHEW}","Yes"],["{@item Pipes of the sewers|PHEW}","Yes"],["{@item Quiver of Ehlonna|PHEW}","No"],["{@item Ring of jumping|PHEW}","Yes"],["{@item Ring of mind shielding|PHEW}","Yes"],["{@item Slippers of spider climbing|PHEW}","Yes"],["{@item Ventilating lungs|PHEW}","Yes"],["{@item Winged boots|PHEW}","Yes"]]},{"type":"table","caption":"Replicable Items (14th-Level Artificer)","colLabels":["Magic Item","Attunement"],"colStyles":["col-11","col-1 text-center"],"rows":[["{@item Amulet of health|PHEW}","Yes"],["{@item Arcane propulsion arm|PHEW}","Yes"],["{@item Gauntlets of ogre power|PHEW}","Yes"],["{@item Boots of levitation|PHEW}","Yes"],["{@item Boots of speed|PHEW}","Yes"],["{@item Bracers of defense|PHEW}","Yes"],["{@item Cloak of the bat|PHEW}","Yes"],["{@item Dimensional shackles|PHEW}","No"],["{@item Gem of seeing|PHEW}","Yes"],["{@item Horn of blasting|PHEW}","No"],["{@item Ring of free action|PHEW}","Yes"],["{@item Ring of protection|PHEW}","Yes"],["{@item Ring of the ram|PHEW}","Yes"]]}],"source":"PHEW","featureType":"AI"},
		{"name":"Repulsion Shield","prerequisite":[{"level":{"level":6,"class":{"name":"Artificer"}},"item":["A shield (requires attunement)"]}],"entries":["A creature gains a +1 bonus to Armor Class while wielding this shield.","The shield has 4 charges. While holding it, the wielder can use a reaction immediately after being hit by a melee attack to expend 1 of the shield's charges and push the attacker up to 15 feet away. The shield regains {@dice 1d4} expended charges daily at dawn."],"source":"PHEW","featureType":"AI"},
		{"name":"Resistant Armor","prerequisite":[{"level":{"level":6,"class":{"name":"Artificer"}},"item":["A suit of armor (requires attunement)"]}],"entries":["While wearing this armor, a creature has resistance to one of the following damage types, which you choose when you infuse the item: acid, cold, fire, force, lightning, necrotic, poison, psychic, radiant, or thunder."],"source":"PHEW","featureType":"AI"},
		{"name":"Returning Weapon","prerequisite":[{"item":["A simple or martial weapon with the thrown property"]}],"entries":["This magic weapon grants a +1 bonus to attack and damage rolls made with it, and it returns to the wielder's hand immediately after it is used to make a ranged attack."],"source":"PHEW","featureType":"AI"},
		{"name":"Improved Pact of the Blade","entries":["When you use your action to cast a cantrip, you can make a single attack with your bond weapon as a bonus action.","In addition, when cast eldritch blast as a warlock cantrip while holding your bond weapon, you can do so as a melee spell attack with the same reach as your bond weapon."],"featureType":"IPB","source":"PHEW"},
		{"name":"Improved Pact of the Chain","entries":["You can use your action to transform your familiar into a new shape, which uses the traits of any beast of your choice with a challenge rating no higher than your warlock level divided by 3. Its type stays the same, and it retains all the benefits of being your familiar.","In this form, your familiar attacks normally, rather than using your attacks. Its hit points do not change, but it gains temporary hit points equal to its new form's hit point maximum until the transformation ends.","This transformation lasts for 1 hour, but ends early if your familiar is dismissed or reduced to 0 hit points.","You must complete a short or long rest before you use this feature again."],"featureType":"IPB","source":"PHEW"},
		{"name":"Improved Pact of the Tome","entries":["Your tome contains two spells of your choice from any class, which you can cast while it is on your person. A spell you choose must be of a level you can cast, as shown on the Warlock table, or a cantrip. The chosen spells count as warlock spells for you, but don't count toward the warlock spells you know.","In addition, choose one skill from Arcana, History, Nature, and Religion. While your tome is on your person, you are considered proficient in that skill. If you already are, your proficiency bonus is doubled."],"featureType":"IPB","source":"PHEW"},
		{"name":"Refined Pact of the Blade","entries":["When you hit a creature with your bond weapon, that creature has disadvantage on the next saving throw it makes against a spell."],"featureType":"RPB","source":"PHEW"},
		{"name":"Refined Pact of the Chain","entries":["You gain an extra use of your Improved Boon feature. If you transform your familiar into a form with a challenge rating of 1/2 or lower, that transformation does not consume a use of your Improved Boon feature.","In addition, your familiar can use your Invocations. It cannot cast your cantrips, but otherwise uses your Charisma modifier, where relevant."],"featureType":"RPB","source":"PHEW"},
		{"name":"Refined Pact of the Tome","entries":["While you are holding your tome, you learn the {@spell counterspell|PHEW} and {@spell dispel magic|PHEW} spells, which do not count toward your number of spells known.","If you use a Pact Arcanum to cast one of these spells, and remove or counter a spell of 5th level or lower, your tome absorbs the spell. One of its pages transforms into a spell scroll containing that spell, which you can use as though it were a warlock spell. The scroll fades after 1 hour."],"featureType":"RPB","source":"PHEW"},
		{
			"name": "Improved Archery",
			"entries": [
				"You no longer have disadvantage on your ranged weapon attacks if you are {@condition prone|PHEW} or a hostile creature is within 5 feet as long as your target is at least 10 feet away from you."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Defense",
			"entries": [
				"While you are wearing armor, you gain an additional +1 bonus to AC, for a total of +2."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Dueling",
			"entries": [
				"When you are wielding a melee weapon in one hand and no other weapons and a creature misses an attack against you, you have advantage on your next attack against that creature."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Great Weapon Fighting",
			"entries": [
				"When you would reroll a dice because of your Great Weapon Fighting style, you instead change the result to the maximum possible dice roll."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Protection",
			"entries": [
				"If you use the dodge action on your turn, any creatures you choose receive those same benefits as long as they are within 5 feet of you."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Two-Weapon Fighting",
			"entries": [
				"You make two separate attacks with your offhand weapon as part of your Attack action instead of one when you engage in two-weapon fighting."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Bling Fighting",
			"entries": [
				"Being unable to see a creature doesn’t give them advantage on attack rolls against you, provided the creature isn’t hidden from you."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Interception",
			"entries": [
				"You may prepare yourself to intercept an enemy attack as a bonus action. If you do, your first use of Interception before the start of your next turn doesn't require you to use your reaction.",
				"In addition, your Interception now blocks up to 4d10 + your proficiency bonus damage."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Thrown Weapon Fighting",
			"entries": [
				"You gain a +1 bonus to the ranged attack roll made using a thrown weapon. You may use the hand you're using to wield a shield to draw a thrown weapon and make a ranged attack with it within your turn as though the hand was free."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Unarmed Fighting",
			"entries": [
				"While you're grappling a creature, as part of your Attack action, you may forgo one of your attacks. If you do, all of your attacks against the grappled creature have advantage and all of its attacks against any target have disadvantage until the start of your next turn."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Improved Superior Technique",
			"entries": [
				"You learn two additional maneuvers of your choice from among those available to the Battle Master archetype and gain two superiority dice."
			],
			"featureType":"IFS",
			"source":"PHEW"
		},
		{
			"name": "Bullying Shot",
			"entries": [
				"You can use the powerful blast and thundering sound of your firearm to shake the resolve of a creature. When making a Charisma (Intimidation) check, you can expend one grit point to gain advantage on the roll."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Dazing Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to attempt to dizzy your opponent. On a hit, the creature suffers normal damage and must make a Constitution saving throw or suffer disadvantage on attacks until the end of their next turn."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Deadeye Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to gain advantage on the attack roll."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Disarming Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to attempt to shoot an object from their hands. On a hit, the creature suffers normal damage and must succeed on a Strength saving throw or drop 1 held object of your choice and have that object be pushed 10 feet away from you."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Forceful Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to attempt to trip them up and force them back. On a hit, the creature suffers normal damage and must succeed on a Strength saving throw or be pushed 15 feet away from you."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Piercing Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to attempt to fire through multiple opponents. The initial attack gains a +1 to the firearm's misfire score. On a hit, the creature suffers normal damage and you make an attack roll with disadvantage against every creature in a line directly behind the target within your first range increment. Only the initial attack can misfire."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Winging Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one grit point to attempt to topple a moving target. On a hit, the creature suffers normal damage and must make a Strength saving throw or be knocked {@condition prone|PHEW}."
			],
			"featureType":"TS",
			"source":"PHEW"
		},
		{
			"name": "Violent Shot",
			"entries": [
				"When you make a firearm attack against a creature, you can expend one or more grit points to enhance the volatility of the attack. For each grit point expended, the attack gains a +2 to the firearm's misfire score. If the attack hits, you can roll one additional weapon damage die per grit point spent when determining the damage."
			],
			"featureType":"TS",
			"source":"PHEW"
		}
	],
	"_meta": {
		"optionalFeatureTypes": {
			"IFS": {
			},
			"IPB": {
			},
			"RPB": {
			},
			"TS": {
			}
		}
	}
}
