{
	"feat": [
		{
			"name": "Actor",
			"source": "PHEW",
			"entries": [
				"Skilled at mimicry and dramatics, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on Charisma ({@skill Deception}) and Charisma ({@skill Performance}) checks when trying to pass yourself off as a different person.",
						"You can mimic the speech of another person or the sounds made by other creatures. You must have heard the person speaking, or heard the creature make the sound, for at least 1 minute. A successful Wisdom ({@skill Insight}) check contested by your Charisma ({@skill Deception}) check allows a listener to determine that the effect is faked."
					]
				}
			],
			"ability": [
				{
					"cha": 1
				}
			]
		},
		{
			"name": "Alert",
			"source": "PHEW",
			"entries": [
				"Always on the lookout for danger, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You add your proficiency bonus to initiative.",
						"You have advantage on checks made to detect traps, as well as on saving throws to prevent triggering them and to resist the effects of mundane traps.",
						"You can't be surprised while you are conscious.",
						"Other creatures don't gain advantage on attack rolls against you as a result of being unseen by you."
					]
				}
			]
		},
		{
			"name": "Athlete",
			"source": "PHEW",
			"entries": [
				"You have undergone extensive physical training to gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you are {@condition prone|PHEW}, standing up uses only 5 feet of your movement.",
						"Climbing and swimming don't cost you extra movement.",
						"You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.",
						"You have resistance to the bludgeoning damage you take from falling from a large height."
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"amount": 1
					}
				}
			]
		},
		{
			"name": "Axe Warrior",
			"source": "PHEW",
			"entries": [
				"You master the {@item battleaxe|PHEW}, {@item flail|PHEW}, {@item greataxe|PHEW}, {@item handaxe|PHEW}, {@item sickle|PHEW}, and {@item war pick|PHEW}. You gain the following benefits when using any of them:",
				{
					"type": "list",
					"items": [
						"Once during your turn, when you take the disarm action and succeed in the attempt with one of these weapons, you deal damage equal to the minimum possible die roll. While a properly donned shield can't be disarmed, if you succeed in an attempt to do so with one of these weapons all attacks against the target gain a +2 modifier until the beginning of their turn.",
						"Critical hits you deal with these weapons double the static bonus to damage on top of the usual dice damage.",
						"When a creature that would provoke an opportunity attack from you if it were to leave your reach moves within your reach it must spend 2 feet of movement for every 1 foot they wish to move."
					]
				}
			]
		},
		{
			"name": "Blade Master",
			"source": "PHEW",
			"entries": [
				"You master the {@item dagger|PHEW}, {@item greatsword|PHEW}, {@item katana|PHEW}, {@item longsword|PHEW}, {@item rapier|PHEW}, {@item scimitar|PHEW}, and {@item shortsword|PHEW}. You gain the following benefits when using any of them:",
				{
					"type": "list",
					"items": [
						"Whenever you deal damage to a lightly armored creature during your turn the damage you deal increases significantly. You deal additional damage equal to your proficiency bonus if the target of your attack is wearing light or no armor and has no natural armor, or if the target's natural armor is 12 or lower (ignoring the Dexterity bonus to AC). You may only deal additional damage to each creature once in this way during each turn.",
						"While you're wielding this weapon, you may use your reaction as a response to being hit by an attack to deflect it. If you do, reduce the slashing, piercing and bludgeoning damage you take by a number of your weapon's damage dice equal to your proficiency bonus. If this reduces the damage you take from that attack to 0 and the attacker is within 5 feet from you, you may make a melee attack with the same weapon as part of this reaction."
					]
				}
			]
		},
		{
			"name": "Blunt Warrior",
			"source": "PHEW",
			"entries": [
				"You master the {@item club|PHEW}, {@item greatclub|PHEW}, {@item light hammer|PHEW}, {@item mace|PHEW}, {@item maul|PHEW}, {@item morningstar|PHEW}, {@item quarterstaff|PHEW} and {@item warhammer|PHEW}. You gain the following benefits when using any of them:",
				{
					"type": "list",
					"items": [
						"Once during your turn, when you take the shove action and succeed in knocking a creature prone, you can automatically deal damage to it equal to the minimum possible die roll.",
						"Whenever you have advantage on a melee attack roll you make with the weapon on your turn and hit, you can knock the target {@condition prone|PHEW} if the lower of the two d20 rolls would also hit the target.",
						"Whenever you have disadvantage on a melee attack roll you make with the weapon on your turn, the target takes bludgeoning damage equal to the minimum possible die roll if the attack misses but the higher of the two d20 rolls would have hit."
					]
				}
			]
		},
		{
			"name": "Charger",
			"source": "PHEW",
			"entries": [
				"When you use your action to Dash, you can use a bonus action to make one melee weapon attack or to shove a creature.",
				"If you move at least 10 feet in a straight line immediately before taking this bonus action, you either add your proficiency bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target an additional 5 feet away from you (if you chose to shove and you succeed) for every 10 consecutive feet you moved in a straight line right before making the attack or shove."
			]
		},
		{
			"name": "Crossbow Expert",
			"source": "PHEW",
			"entries": [
				"Thanks to extensive practice with the crossbow, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You ignore the loading quality of crossbows with which you are proficient.",
						"Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls. You lose this benefit when you miss a ranged attack until you move to a space that isn't threatened by a hostile creature or you take the Disengage action.",
						"When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a {@item hand crossbow|PHEW} you are holding."
					]
				}
			]
		},
		{
			"name": "Defensive Duelist",
			"source": "PHEW",
			"prerequisite": [
				{
					"ability": [
						{
							"dex": 13
						}
					]
				}
			],
			"entries": [
				"When you are wielding a finesse weapon with which you are proficient and another creature hits you with a weapon attack, you can use your reaction to add your proficiency bonus to your AC for that round, potentially causing the attack to miss you."
			]
		},
		{
			"name": "Dual Wielder",
			"source": "PHEW",
			"entries": [
				"You master fighting with two weapons, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.",
						"You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.",
						"You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.",
						"When you use your reaction to make an opportunity attack, you can make an attack with each of the two weapons you're wielding instead of a single attack."
					]
				}
			]
		},
		{
			"name": "Dungeon Delver",
			"source": "PHEW",
			"entries": [
				"Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on Wisdom ({@skill Perception}) and Intelligence ({@skill Investigation}) checks made to detect the presence of secret doors.",
						"You have advantage on saving throws made to avoid or resist traps.",
						"You have resistance to the damage dealt by traps.",
						"Traveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom ({@skill Perception}) score.",
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				}
			]
		},
		{
			"name": "Durable",
			"source": "PHEW",
			"entries": [
				"Hardy and resilient, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you roll a Hit Die to regain hit points, reroll any dice lower than your proficiency bonus.",
						"You recover all of your Hit Die at the end of a long rest."
					]
				}
			],
			"ability": [
				{
					"con": 1
				}
			]
		},
		{
			"name": "Elemental Adept",
			"source": "PHEW",
			"prerequisite": [
				{
					"spellcasting": true
				}
			],
			"entries": [
				"When you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder.",
				"Spells you cast ignore resistance to damage of the chosen type. In addition, when you roll damage for a spell you cast that deals damage of that type, you can treat any 1 on a damage die as a 2.",
				"You can select this feat multiple times. Each time you do so, you must choose a different damage type."
			]
		},
		{
			"name": "Grappler",
			"source": "PHEW",
			"prerequisite": [
				{
					"ability": [
						{
							"str": 13
						}
					]
				}
			],
			"entries": [
				"You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on attack rolls against a creature you are grappling.",
						"You can use your action to try to pin a creature {@condition grappled|PHEW} by you. To do so, make another grapple check. If you succeed, you and the creature are both {@condition restrained|PHEW} until the grapple ends."
					]
				}
			]
		},
		{
			"name": "Great Weapon Master",
			"source": "PHEW",
			"entries": [
				"You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"On your turn, when you score a critical hit with a melee weapon or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a bonus action.",
						"Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a penalty to the attack roll equal to your proficiency bonus. If the attack hits, you add twice your proficiency bonus to the attack's damage."
					]
				}
			]
		},
		{
			"name": "Healer",
			"source": "PHEW",
			"entries": [
				"You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use a {@item healer's kit|PHEW} to stabilize a dying creature, that creature also regains 1 hit point.",
						"As an action, you can spend one use of a {@item healer's kit|PHEW} to tend to a creature and restore {@dice 1d6} hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice + twice your proficiency bonus. The creature can't regain hit points from this feat again until it finishes a short or long rest.",
						"If you spend a short rest next to a bonfire with an amount of Estus Flasks no larger than twice your proficiency bonus, any creature that drinks from any of those flasks before the next dawn benefits from them as if they were attuned to it."
					]
				}
			]
		},
		{
			"name": "Heavy Armor Master",
			"source": "PHEW",
			"prerequisite": [
				{
					"proficiency": [
						{
							"armor": "heavy"
						}
					]
				}
			],
			"entries": [
				"You can use your armor to deflect strikes that would kill others. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are wearing heavy armor, bludgeoning, piercing, and slashing damage that you take is reduced by your proficiency bonus.",
						"If you're wearing heavy armor its weight doesn't count towards your encumbrance limit."
					]
				}
			],
			"ability": [
				{
					"str": 1
				}
			]
		},
		{
			"name": "Inspiring Leader",
			"source": "PHEW",
			"prerequisite": [
				{
					"ability": [
						{
							"cha": 13
						}
					]
				}
			],
			"entries": [
				"You can spend 10 minutes inspiring your companions, shoring up their resolve to fight. When you do so, choose a number of friendly creatures of up to your proficiency bonus + your charisma mod (which can include yourself) within 30 feet of you who can see or hear you and who can understand you. Each creature can gain temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points from this feat again until it has finished a short or long rest."
			]
		},
		{
			"name": "Keen Mind",
			"source": "PHEW",
			"entries": [
				"You have a mind that can track time, direction, and detail with uncanny precision. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You always know which way is north.",
						"You always know the number of hours left before the next sunrise or sunset.",
						"You can accurately recall anything you have seen or heard within the past month."
					]
				}
			],
			"ability": [
				{
					"int": 1
				}
			]
		},
		{
			"name": "Linguist",
			"source": "PHEW",
			"entries": [
				"You have studied languages and codes, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn three languages of your choice.",
						"You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it."
					]
				}
			],
			"ability": [
				{
					"int": 1
				}
			]
		},
		{
			"name": "Lucky",
			"source": "PHEW",
			"entries": [
				"You have inexplicable luck that seems to kick in at just the right moment.",
				"You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw.",
				"You can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled.",
				"You regain your expended luck points when you finish a long rest."
			]
		},
		{
			"name": "Mage Slayer",
			"source": "PHEW",
			"entries": [
				"You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature.",
						"When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.",
						"You have advantage on saving throws against spells cast by creatures within 5 feet of you."
					]
				}
			]
		},
		{
			"name": "Magic Initiate",
			"source": "PHEW",
			"entries": [
				"Choose a class: {@filter bard|spells|level=0;1|class=bard}, {@filter cleric|spells|level=0;1|class=cleric}, {@filter druid|spells|level=0;1|class=druid}, {@filter sorcerer|spells|level=0;1|class=sorcerer}, {@filter warlock|spells|level=0;1|class=warlock}, or {@filter wizard|spells|level=0;1|class=wizard}. You learn two cantrips of your choice from that class's spell list.",
				"In addition, choose one 1st-level spell from that same list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again using this feat.",
				"Your spellcasting ability for these spells depends on the class you chose: Charisma for {@filter bard|spells|level=0;1|class=bard}, {@filter sorcerer|spells|level=0;1|class=sorcerer}, or {@filter warlock|spells|level=0;1|class=warlock}; Wisdom for {@filter cleric|spells|level=0;1|class=cleric} or {@filter druid|spells|level=0;1|class=druid}; or Intelligence for {@filter wizard|spells|level=0;1|class=wizard}."
			]
		},
		{
			"name": "Martial Adept",
			"source": "PHEW",
			"entries": [
				"You have martial training that allows you to perform special combat maneuvers. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn two {@filter maneuvers|optionalfeatures|feature type=MV:B} of your choice from among those available to the {@class fighter|phb|Battle Master|Battle Master|phb|Martial Archetype 3} archetype in the fighter class. If a maneuver you use requires your target to make a saving throw to resist the maneuver's effects, the saving throw DC equals 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice).",
						"You gain one superiority die, which is a d6 (this die is added to any superiority dice you have from another source). This die is used to fuel your maneuvers. A superiority die is expended when you use it. You regain your expended superiority dice when you finish a short or long rest."
					]
				}
			]
		},
		{
			"name": "Medium Armor Master",
			"source": "PHEW",
			"prerequisite": [
				{
					"proficiency": [
						{
							"armor": "medium"
						}
					]
				}
			],
			"entries": [
				"You have practiced moving in medium armor to gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Wearing medium armor doesn't impose disadvantage on your Dexterity ({@skill Stealth}) checks.",
						"When you wear medium armor, you can add 3, rather than 2, to your AC if you have a Dexterity of 16 or higher.",
						"If you're wearing medium armor its weight doesn't count towards your encumbrance limit."
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex"
						],
						"amount": 1
					}
				}
			]
		},
		{
			"name": "Mobile",
			"source": "PHEW",
			"entries": [
				"You are exceptionally speedy and agile. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Your speed increases by 10 feet.",
						"When you use the Dash action, difficult terrain doesn't cost you extra movement on that turn.",
						"When you make a melee attack against a creature, you don't provoke opportunity attacks from that creature for the rest of the turn, whether you hit or not."
					]
				}
			]
		},
		{
			"name": "Mounted Combatant",
			"source": "PHEW",
			"entries": [
				"You are a dangerous foe to face while mounted. While you are mounted and aren't {@condition incapacitated|PHEW}, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on melee attack rolls against any unmounted creature that is smaller than your mount.",
						"You can force an attack targeted at your mount to target you instead.",
						"If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw, and only half damage if it fails."
					]
				}
			]
		},
		{
			"name": "Observant",
			"source": "PHEW",
			"entries": [
				"Quick to notice details of your environment, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"If you can see a creature's mouth while it is speaking a language you understand, you can interpret what it's saying by reading its lips.",
						"You have a +5 bonus to your passive Wisdom ({@skill Perception}) and passive Intelligence ({@skill Investigation}) scores."
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"int",
							"wis"
						],
						"amount": 1
					}
				}
			]
		},
		{
			"name": "Polearm Master",
			"source": "PHEW",
			"entries": [
				"You can keep your enemies at bay with reach weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you take the Attack action and attack with only a {@item glaive|PHEW}, {@item halberd|PHEW}, {@item javelin|PHEW}, {@item quarterstaff|PHEW}, {@item spear|PHEW}, or {@item trident|PHEW}, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a d4, and the attack deals bludgeoning damage.",
						"While you are wielding a {@item glaive|PHEW}, {@item halberd|PHEW}, {@item javelin|PHEW}, {@item lance|PHEW}, {@item pike|PHEW}, {@item quarterstaff|PHEW}, {@item spear|PHEW}, or {@item trident|PHEW} other creatures provoke an opportunity attack from you when they enter your reach."
					]
				}
			]
		},
		{
			"name": "Prodigy",
			"source": "PHEW",
			"entries": [
				"You have a knack for learning new things. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain one skill or tool proficiency of your choice, and fluency in one language of your choice.",
						"Choose one skill or tool in which you have proficiency. You gain expertise with that skill, which means your proficiency bonus is doubled for any ability check you make with it. The skill you choose must be one that isn't already benefiting from a feature, such as Expertise, that doubles your proficiency bonus.",
						"You gain one skill or tool proficiency of your choice, or proficiency with shields and an armor type of your choice. You must be proficient with light armor in order to choose medium armor, and you must be proficient in medium armor in order to choose heavy armor.",
						"You gain one skill or tool proficiency of your choice, or proficiency with up to four simple or martial weapons."
					]
				}
			]
		},
		{
			"name": "Resilient",
			"source": "PHEW",
			"entries": [
				"Choose one ability score. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency in saving throws using the chosen ability."
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"amount": 1,
						"textreference": true
					}
				}
			]
		},
		{
			"name": "Ritual Caster",
			"source": "PHEW",
			"prerequisite": [
				{
					"ability": [
						{
							"int": 13
						},
						{
							"wis": 13
						}
					]
				}
			],
			"entries": [
				"You have learned a number of spells that you can cast as rituals. These spells are written in a ritual book, which you must have in hand while casting one of them.",
				"When you choose this feat, you acquire a ritual book holding two 1st-level spells of your choice. Choose one of the following classes: {@filter bard|spells|level=1|class=bard|components & miscellaneous=ritual}, {@filter cleric|spells|level=1|class=cleric|components & miscellaneous=ritual}, {@filter druid|spells|level=1|class=druid|components & miscellaneous=ritual}, {@filter sorcerer|spells|level=1|class=sorcerer|components & miscellaneous=ritual}, {@filter warlock|spells|level=1|class=warlock|components & miscellaneous=ritual}, or {@filter wizard|spells|level=1|class=wizard|components & miscellaneous=ritual}. You must choose your spells from that class's spell list, and the spells you choose must have the ritual tag. The class you choose also determines your spellcasting ability for these spells: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard.",
				"If you come across a spell in written form, such as a magical spell scroll or a wizard's spellbook, you might be able to add it to your ritual book. The spell must be on the spell list for the class you chose, the spell's level can be no higher than half your level (rounded up), and it must have the ritual tag. The process of copying the spell into your ritual book takes 2 hours per level of the spell, and costs 50 gp per level. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it."
			]
		},
		{
			"name": "Savage Attacker",
			"source": "PHEW",
			"entries": [
				"Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total.",
				"Whenever you score a critical hit, you can choose a number of dice equal to your proficiency bonus before you make the roll. Those dice are considered to have rolled the maximum number possible without needing to roll them."
			]
		},
		{
			"name": "Sentinel",
			"source": "PHEW",
			"entries": [
				"You have mastered techniques to take advantage of every drop in any enemy's guard, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"When you hit a creature with an opportunity attack, the creature's speed becomes 0 for the rest of the turn.",
						"Creatures provoke opportunity attacks from you even if they take the Disengage action before leaving your reach.",
						"When a creature within 5 feet of you makes an attack against a target other than you (and that target doesn't have this feat), you can use your reaction to make a melee weapon attack against the attacking creature."
					]
				}
			]
		},
		{
			"name": "Sharpshooter",
			"source": "PHEW",
			"entries": [
				"You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.",
						"Your ranged weapon attacks ignore half cover and three-quarters cover.",
						"Before you make an attack with a two-handed ranged weapon that you are proficient with, you can choose to take a penalty to the attack roll equal to your proficiency bonus. If the attack hits, you add twice your proficiency modifier to the attack's damage."
					]
				}
			]
		},
		{
			"name": "Skulker",
			"source": "PHEW",
			"prerequisite": [
				{
					"ability": [
						{
							"dex": 13
						}
					]
				}
			],
			"entries": [
				"You are expert at slinking through shadows. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can try to hide when you are lightly obscured from the creature from which you are hiding.",
						"When you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.",
						"If you make a weapon attack against a creature in which you had advantage from being unseen by it, you have advantage on every weapon attack against the creature until the end of that turn.",
						"Dim light doesn't impose disadvantage on your Wisdom ({@skill Perception}) checks relying on sight.",
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				}
			]
		},
		{
			"name": "Spell Sniper",
			"source": "PHEW",
			"prerequisite": [
				{
					"spellcasting": true
				}
			],
			"entries": [
				"You have learned techniques to enhance your attacks with certain kinds of spells, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"When you cast a spell that requires you to make an attack roll, the spell's range is doubled.",
						"Your ranged spell attacks ignore half cover and three-quarters cover.",
						"You learn one cantrip that requires an attack roll. Choose the cantrip from the {@filter bard|spells|level=0|class=bard|spell attack=m;r;o}, {@filter cleric|spells|level=0|class=cleric|spell attack=m;r;o}, {@filter druid|spells|level=0|class=druid|spell attack=m;r;o}, {@filter sorcerer|spells|level=0|class=sorcerer|spell attack=m;r;o}, {@filter warlock|spells|level=0|class=warlock|spell attack=m;r;o}, or {@filter wizard|spells|level=0|class=wizard|spell attack=m;r;o} spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard."
					]
				}
			]
		},
		{
			"name": "Sword & Board Master",
			"source": "PHEW",
			"entries": [
				"You are expert at fighting with shields. You gain the following benefits while wielding a weapon on one hand and a shield on the other:",
				{
					"type": "list",
					"items": [
						"Whenever you take the Attack action with a versatile weapon on your turn, you can make one of your attacks while two-handing the weapon, assuming your shield hand is otherwise free.",
						"If you take the Attack action on your turn, you can use a bonus action to try to shove a creature within 5 feet of you with your shield.",
						"If you aren't {@condition incapacitated|PHEW}, you can add your shield's AC bonus to any Dexterity saving throw you make against a spell or other harmful effect that targets only you.",
						"If you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you can use your reaction to take no damage if you succeed on the saving throw, interposing your shield between yourself and the source of the effect."
					]
				}
			]
		},
		{
			"name": "Tavern Brawler",
			"source": "PHEW",
			"entries": [
				"Accustomed to rough-and-tumble fighting using whatever weapons happen to be at hand, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You are proficient with improvised weapons.",
						"Your unarmed strike uses a d4 for damage.",
						"When you hit a creature with an unarmed strike or an improvised weapon on your turn, you can use a bonus action to attempt to grapple the target."
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"con"
						],
						"amount": 1
					}
				}
			]
		},
		{
			"name": "Tough",
			"source": "PHEW",
			"entries": [
				"Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
			]
		},
		{
			"name": "War Caster",
			"source": "PHEW",
			"prerequisite": [
				{
					"spellcasting": true
				}
			],
			"entries": [
				"You have practiced casting spells in the midst of combat, learning techniques that grant you the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on Constitution saving throws that you make to maintain your concentration on a spell when you take damage.",
						"You can perform the somatic components of spells even when you have weapons or a {@item shield|PHEW} in one or both hands.",
						"When a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, rather than making an opportunity attack. The spell must have a casting time of 1 action and must target only that creature."
					]
				}
			]
		}
	]
}
