{
	"variantrule": [
		{
			"name": "Action Options",
			"entries": [
				"This section provides new action options for combat. They can be added as a group or individually to your game.",
				{
					"name": "Climb onto a Bigger Creature",
					"type": "entries",
					"entries": [
						"If one creature wants to jump onto another creature, it can do so by grappling. A small or Medium creature has little chance of making a successful grapple against a Huge or Gargantuan creature, however, unless magic has granted the grappler supernatural might.",
						"As an alternative, a suitably large opponent can be treated as terrain for the purpose of jumping onto its back or clinging to a limb. After making any ability checks necessary to get into position and onto the larger creature, the smaller creature uses its action to make a Strength (Athletics) or Dexterity (Acrobatics) check contested by the target's Dexterity (Acrobatics) check. If it wins the contest, the smaller creature successfully moves into the target creature's space, the smaller creature moves with the target and has advantage on attack rolls against it.",
						"The smaller creature can move around within the larger creature's space, treating the space as difficult terrain. The larger creature's ability to attack the smaller creature depends on the smaller creature's location, and is left to your discretion. The larger creature can dislodge the smaller creature as an action—knocking it off, scraping it against a wall, or grabbing and throwing it—by making a Strength (Athletics) check contested by the smaller creature's Strength (Athletics) or Dexterity (Acrobatics) check. The smaller creature chooses which ability to use."
					]
				},
				{
					"name": "Disarm",
					"type": "entries",
					"entries": [
						"A creature can use a weapon attack to knock a weapon or another item from a target's grasp. The attacker makes an attack roll contested by the target's Strength (Athletics) check or Dexterity (Acrobatics) check. If the attacker wins the contest, the attack causes no damage or other ill effect, but the defender drops the item.",
						"The attacker has disadvantage on its attack roll if the target is holding the item with two or more hands. The target has advantage on its ability check if it is larger than the attacking creature, or disadvantage if it is smaller."
					]
				},
				{
					"name": "Mark",
					"type": "entries",
					"entries": [
						"This option makes it easier for melee combatants to harry each other with opportunity attacks.",
						"When a creature makes a melee attack, it can also mark its target. Until the end of the attacker's next turn, any opportunity attack it makes against the marked target has advantage. The opportunity attack doesn't expend the attacker's reaction, but the attacker can't make the attack if anything, such as the {@condition incapacitated} condition or the shocking grasp spell, is preventing it from taking reactions. The attacker is limited to one opportunity attack per turn."
					]
				},
				{
					"name": "Overrun",
					"type": "entries",
					"entries": [
						"When a creature tries to move through a hostile creature's space, the mover can try to force its way through by overrunning the hostile creature. As an action or a bonus action, the mover makes a Strength (Athletics) check contested by the hostile creature's Strength (Athletics) check. The creature attempting the overrun has advantage on this check if it is larger than the hostile creature, or disadvantage if it is smaller. If the mover wins the contest, it can move through the hostile creature's space once this turn."
					]
				},
				{
					"name": "Shove Aside",
					"type": "entries",
					"entries": [
						"With this option, a creature uses the special shove attack from the Player's Handbook to force a target to the side, rather than away. The attacker has disadvantage on its Strength (Athletics) check when it does so. If that check is successful, the attacker moves the target 5 feet to a different space within its reach."
					]
				},
				{
					"name": "Tumble",
					"type": "entries",
					"entries": [
						"A creature can try to tumble through a hostile creature's space, ducking and weaving past the opponent. As an action or a bonus action, the tumbler makes a Dexterity (Acrobatics) check contested by the hostile creature's Dexterity (Acrobatics) check. If the tumbler wins the contest, it can move through the hostile creature's space once this turn."
					]
				}
			],
			"source": "PHEW"
		},
		{
			"name": "Bounded Accuracy",
			"entries": [
				"If you would receive a flat modifier to AC, saving throws, or attack rolls from several magic items you only receive the biggest modifier for each category. If a magical item gives one of these modifiers when equipped, you must attune to it in order to benefit from the modifier."
			],
			"source": "PHEW"
		},
		{
			"name": "Two-Weapon Fighting",
			"entries": [
				"When you take the Attack action and attack with a light melee weapon that you're holding in one hand, you can make an attack with a different light melee weapon that you're holding in the other hand as part of the Attack action. You don't add your ability modifier to the damage of the bonus attack, unless that modifier is negative.",
				"If either weapon has the thrown property, you can throw the weapon, instead of making a melee attack with it."
			],
			"source": "PHEW"
		},
		{
			"name": "Healer's Kit",
			"entries": [
				"During a short rest you can spend 1 use of a healer's kit and make a Medicine check in order to aid a creature with their natural healing process. If you do so, the target creature maximizes the result on up to (check - 10) / 2 hit dice it spent during the rest. Doing this keeps you occupied during the short rest but it counts as light enough activity to receive benefits from it normally."
			],
			"source": "PHEW"
		},
		{
			"name": "Fall Damage",
			"entries": [
				"Fall damage caps at 50d6 when falling 500ft or more."
			],
			"source": "PHEW"
		},
		{
			"name": "Damage Calculation",
			"entries": [
				"Properties and effects that double or halve damage values cancel each other out 1:1. Whenever you halve a damage value you must round up instead of down."
			],
			"source": "PHEW"
		},
		{
			"name": "Exhaustion and Death",
			"entries": [
				"Whenever your hit points get reduced to 0 and you fall unconscious, you gain 1 level of exhaustion. Whenever a creature is resurrected it has 5 levels of exhaustion. The soul of a creature that dies from exhaustion vanishes, making resurrection impossible through normal magical means."
			],
			"source": "PHEW"
		},
		{
			"name": "Grappling",
			"entries": [
				"A creature that starts a grapple attempt receives a +5 modifier to the roll for each size category larger than its target the creature is. If the grapple target makes a Strength Athletics check when attempting to avoid or escape the grapple, it receives a +5 modifier for each size category larger than the grappling creature it is."
			],
			"source": "PHEW"
		},
		{
			"name": "Crafting a Magic Item",
			"entries": [
				"Magic items are the DM's purview, so you decide how they fall into the party's possession. As an option, you can allow player characters to craft magic items.",
				"The creation of a magic item is a lengthy, expensive task. To start, a character must have a formula that describes the construction of the item. The character must also be a spellcaster with spell slots and must be able to cast any spells that the item can produce. Moreover, the character must meet a level minimum determined by the item's rarity, as shown in the Crafting Magic Items table. For example, a 3rd-level character could create a wand of magic missiles (an uncommon item), as long as the character has spell slots and can cast magic missile. That same character could make a +1 weapon (another uncommon item), no particular spell required.",
				"You can decide that certain items also require special materials or locations to be created. For example, a character might need {@item alchemist's supplies|phb} to brew a particular potion, or the formula for a flame tongue might require that the weapon be forged with lava.",
				{
					"type": "table",
					"caption": "Crafting Magic Items",
					"colLabels": [
						"Item Rarity",
						"Creation Cost",
						"Minimum Level"
					],
					"colStyles": [
						"col-4",
						"col-4 text-right",
						"col-4 text-center"
					],
					"rows": [
						[
							"Common",
							"100 gp",
							"3rd"
						],
						[
							"Uncommon",
							"500 gp",
							"3rd"
						],
						[
							"Rare",
							"5,000 gp",
							"6th"
						],
						[
							"Very rare",
							"50,000 gp",
							"11th"
						],
						[
							"Legendary",
							"500,000 gp",
							"17th"
						]
					]
				},
				"An item has a creation cost specified in the Crafting Magic Items table. A character engaged in the crafting of a magic item makes progress in 25 gp increments, spending that amount for each day of work until the total cost is paid. The character is assumed to work for 8 hours each of those days. Thus, creating an uncommon magic item takes 20 days and 500 gp. You are free to adjust the costs to better suit your campaign.",
				"If a spell will be produced by the item being created, the creator must expend one spell slot of the spell's level for each day of the creation process. The spell's material components must also be at hand throughout the process. If the spell normally consumes those components, they are consumed by the creation process. If the item will be able to produce the spell only once, as with a spell scroll, the components are consumed only once by the process. Otherwise, the components are consumed once each day of the item's creation.",
				"Multiple characters can combine their efforts to create a magic item if each of them meets the level prerequisite. Each character can contribute spells, spell slots and components, as long as everyone participates during the entire crafting process. Each character can contribute 25 gp worth of effort for each day spent helping to craft the item.",
				"Normally, a character who undertakes this activity creates a magic item described in chapter 7, \"Treasure.\" At your discretion, you can allow players to design their own magic items, using the guidelines in chapter 9, \"Dungeon Master's Workshop.\"",
				"While crafting a magic item, a character can maintain modest lifestyle without having to pay the 1 gp per day, or a comfortable lifestyle at half the normal cost (see chapter 5, \"Equipment,\" of the Player's Handbook)."
			],
			"source": "PHEW"
		},
		{
			"name": "Encumbrance",
			"entries": [
				"The rules for lifting and carrying are intentionally simple. Here is a variant if you are looking for more detailed rules for determining how a character is hindered by the weight of equipment. When you use this variant, ignore the Strength column of the Armor table in chapter 5.",
				"If you carry weight in excess of 5 times your Strength score, you are encumbered, which means your speed drops by 10 feet.",
				"If you carry weight in excess of 10 times your Strength score, up to your maximum carrying capacity, you are instead heavily encumbered, which means your speed drops by 20 feet and you have disadvantage on ability checks, attack rolls, and saving throws that use Strength, Dexterity, or Constitution."
			],
			"source": "PHEW"
		},
		{
			"name": "Feats",
			"entries": [
				"A feat represents a talent or an area of expertise that gives a character special capabilities. It embodies training, experience, and abilities beyond what a class provides.",
				"At certain levels, your class gives you the Ability Score Improvement feature. Using the optional feats rule, you can forgo taking that feature to take a feat of your choice instead. You can take each feat only once, unless the feat's description says otherwise.",
				"You must meet any prerequisite specified in a feat to take that feat. If you ever lose a feat's prerequisite, you can't use that feat until you regain the prerequisite. For example, the Grappler feat requires you to have a Strength of 13 or higher. If your Strength is reduced below 13 somehow—perhaps by a withering curse—you can't benefit from the Grappler feat until your Strength is restored.",
				{
					"type": "inline",
					"entries": [
						"See the ",
						{
							"type": "link",
							"href": {
								"type": "internal",
								"path": "feats.html"
							},
							"text": "Feats section"
						},
						" for more information."
					]
				}
			],
			"source": "PHEW"
		},
		{
			"name": "Hitting Cover",
			"entries": [
				"When a ranged attack misses a target that has cover, you can use this optional rule to determine whether the cover was struck by the attack.",
				"First, determine whether the attack roll would have hit the protected target without the cover. If the attack roll falls within a range low enough to miss the target but high enough to strike the target if there had been no cover, the object used for cover is struck. If a creature is providing cover for the missed creature and the attack roll exceeds the AC of the covering creature, the covering creature is hit."
			],
			"source": "PHEW"
		},
		{
			"name": "More Difficult Identification",
			"entries": [
				"If you prefer magic items to have a greater mystique, consider removing the ability to identify the properties of a magic item during a short rest, and require the identify spell, experimentation, or both to reveal what a magic item does."
			],
			"source": "PHEW"
		},
		{
			"type": "section",
			"name": "Multiclassing",
			"entries": [
				"Multiclassing allows you to gain levels in multiple classes. Doing so lets you mix the abilities of those classes to realize a character concept that might not be reflected in one of the standard class options.",
				"With this rule, you have the option of gaining a level in a new class whenever you advance in level, instead of gaining a level in your current class. Your levels in all your classes are added together to determine your character level. For example, if you have three levels in wizard and two in fighter, you're a 5th-level character.",
				"As you advance in levels, you might primarily remain a member of your original class with just a few levels in another class, or you might change course entirely. never looking back at the class you left behind. You might even start progressing in a third or fourth class. Compared to a single-class character of the same level, you'll sacrifice some focus in exchange for versatility.",
				{
					"type": "entries",
					"name": "Prerequisites",
					"entries": [
						"To qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one, as shown in the Multiclassing Prerequisites table. For example, a barbarian who decides to multiclass into the druid class must have both Strength and Wisdom scores of 13 or higher. Without the full training that a beginning character receives, you must be a quick study in your new class, having a natural aptitude that is reflected by higher-than-average ability scores.",
						{
							"type": "table",
							"caption": "Multiclassing Prerequisites",
							"colLabels": [
								"Class",
								"Ability Score Minimum"
							],
							"colStyles": [
								"col-2",
								"col-10"
							],
							"rows": [
								[
									"{@class Artificer}",
									"Intelligence 13"
								],
								[
									"{@class Barbarian}",
									"Strength 13"
								],
								[
									"{@class Bard}",
									"Charisma 13"
								],
								[
									"{@class Cleric}",
									"Wisdom 13"
								],
								[
									"{@class Druid}",
									"Wisdom 13"
								],
								[
									"{@class Fighter}",
									"Strength 13 or Dexterity 13"
								],
								[
									"{@class Monk}",
									"Dexterity 13 and Wisdom 13"
								],
								[
									"{@class Paladin}",
									"Strength 13 and Charisma 13"
								],
								[
									"{@class Ranger}",
									"Dexterity 13 and Wisdom 13"
								],
								[
									"{@class Rogue}",
									"Dexterity 13"
								],
								[
									"{@class Sorcerer}",
									"Charisma 13"
								],
								[
									"{@class Warlock}",
									"Charisma 13"
								],
								[
									"{@class Wizard}",
									"Intelligence 13"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Experience Points",
					"entries": [
						"The experience point cost to gain a level is always based on your total character level, as shown in the Character Advancement table in chapter I, not your level in a particular class. So, if you are a cleric 6/fighter 1, you must gain enough XP to reach 8th level before you can take your second level as a fighter or your seventh level as a cleric."
					]
				},
				{
					"type": "entries",
					"name": "Hit Points and Hit Dice",
					"entries": [
						"You gain the hit points from your new class as described for levels after 1st. You gain the 1st-level hit points for a class only when you are a 1st-level character.",
						"You add together the Hit Dice granted by all your classes to form your pool of Hit Dice. if the Hit Dice are the same die type, you can simply pool them together. For example, both the fighter and the paladin have a {@dice d10}, so if you are a paladin 5/fighter 5, you have ten {@dice d10} Hit Dice. If your classes give you Hit Dice of different types, keep track of them separately. If you are a paladin 5/cleric 5, for example, you have five {@dice d10} Hit Dice and five {@dice d8} Hit Dice."
					]
				},
				{
					"type": "entries",
					"name": "Proficiency Bonus",
					"entries": [
						"Your proficiency bonus is always based on your total character level, as shown in the Character Advancement table in chapter 1, not your level in a particular class. For example, if you are a fighter 3/rogue 2, you have the proficiency bonus of a 5th-level character, which is +3."
					]
				},
				{
					"type": "entries",
					"name": "Proficiencies",
					"entries": [
						"When you gain a level in a class other than your first, you gain only some of that class's starting proficiencies, as shown in the Multiclassing Proficiencies table.",
						{
							"type": "table",
							"caption": "Multiclassing Proficiencies",
							"colLabels": [
								"Class",
								"Proficiencies Gained"
							],
							"colStyles": [
								"col-2",
								"col-10"
							],
							"rows": [
								[
									"{@class Artificer}",
									"Light armor, Arcana"
								],
								[
									"{@class Barbarian}",
									"Shields, simple weapons, martial weapons"
								],
								[
									"{@class Bard}",
									"Light armor, one skill of your choice, one musical instrument of your choice"
								],
								[
									"{@class Cleric}",
									"Light armor, medium armor, shields"
								],
								[
									"{@class Druid}",
									"Light armor, medium armor, shields (druids will not wear armor or use shields made of metal)"
								],
								[
									"{@class Fighter}",
									"Light armor, medium armor, shields, simple weapons, martial weapons"
								],
								[
									"{@class Monk}",
									"Simple weapons, shortswords"
								],
								[
									"{@class Paladin}",
									"Light armor, medium armor, shields, simple weapons, martial weapons"
								],
								[
									"{@class Ranger}",
									"Light armor, medium armor, shields, simple weapons, martial weapons, one skill from the class's skill list"
								],
								[
									"{@class Rogue}",
									"Light armor, one skill from the class's skill list, thieves' tools"
								],
								[
									"{@class Sorcerer}",
									"—"
								],
								[
									"{@class Warlock}",
									"Light armor, simple weapons"
								],
								[
									"{@class Wizard}",
									"—"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Class Features",
					"entries": [
						"When you gain a new level in a class, you get its features for that level. A few features, however, have additional rules when you're multiclassing: Channel Divinity, Extra Attack, Unarmored Defense, and Spellcasting.",
						{
							"type": "entries",
							"name": "Channel Divinity",
							"entries": [
								"If you already have the Channel Divinity feature and gain a level in a class that also grants the feature, you gain the Channel Divinity effects granted by that class, but getting the feature again doesn't give you an additional use of it. You gain additional uses only when you reach a class level that explicitly grants them to you. For example, if you are a cleric 6/paladin 4, you can use Channel Divinity twice between rests because you are high enough level in the cleric class to have more uses. Whenever you use the feature, you can choose any of the Channel Divinity effects available to you from your two classes."
							]
						},
						{
							"type": "entries",
							"name": "Extra Attack",
							"entries": [
								"If you gain the Extra Attack class feature from more than one class, the features don't add together. You can't make more than two attacks with this feature unless it says you do (as the fighter's version of Extra Attack does). Similarly, the warlock's eldritch invocation Thirsting Blade doesn't give you additional attacks if you also have Extra Attack."
							]
						},
						{
							"type": "entries",
							"name": "Unarmored Defense",
							"entries": [
								"If you already have the Unarmored Defense feature, you can't gain it again from another class."
							]
						},
						{
							"type": "entries",
							"name": "Spellcasting",
							"entries": [
								"Your capacity for spellcasting depends partly on your combined levels in all your spellcasting classes and partly on your individual levels in those classes. Once you have the Spellcasting feature from more than one class, use the rules below. If you multiclass but have the Spellcasting feature from only one class, you follow the rules as described in that class.",
								{
									"type": "entries",
									"name": "Spells Known and Prepared",
									"entries": [
										"You determine what spells you know and can prepare for each class individually, as if you were a single-classed member of that class. If you are a ranger 4/wizard 3, for example, you know three 1st-level ranger spells based on your levels in the ranger class. As 3rd-level wizard, you know three wizard cantrips, and your spellbook contains ten wizard spells, two of which (the two you gained when you reached 3rd level as a wizard) can be 2nd-level spells. If your intelligence is 16, you can prepare six wizard spells from your spellbook.",
										"Each spell you know and prepare is associated with one of your classes, and you use the spellcasting ability of that class when you cast the spell. Similarly, a spellcasting focus, such as a holy symbol, can he used only for the spells from the class associated with that focus."
									]
								},
								{
									"type": "entries",
									"name": "Spell Slots",
									"entries": [
										"You determine your available spell slots by adding together all your levels in the bard, cleric, druid, sorcerer, and wizard classes, half your levels (rounded down) in the paladin and ranger classes, and a third of your fighter or rogue levels (rounded down) if you have the Eldritch Knight or the Arcane Trickster feature. Use this total to determine your spell slots by consulting the Multiclass Spellcaster table.",
										"If you have more than one spellcasting class, this table might give you spell slots of a level that is higher than the spells you know or can prepare. You can use those slots, but only to cast your lower-level spells. If a lower-level spell that you cast, like {@spell burning hands}, has an enhanced effect when cast using a higher-level slot, you can use the enhanced effect, even though you don't have any spells of that higher level.",
										"For example, if you are the aforementioned ranger 4/wizard 3. you count as a 5th-level character when determining your spell slots: you have four 1st-level slots, three 2nd-level slots, and two 3rd-level slots. However, you don't know any 3rd-level spells, nor do you know any 2nd-level ranger spells. You can use the spell slots of those levels to cast the spells you do know—and potentially enhance their effects."
									]
								},
								{
									"type": "entries",
									"name": "Pact Magic",
									"entries": [
										"If you have both the Spellcasting class feature and the Pact Magic class feature from the warlock class, you can use the spell slots you gain from the Pact Magic feature to cast spells you know or have prepared from classes with the Spellcasting class feature, and you can use the spell slots you gain from the Spellcasting class feature to cast warlock spells you know."
									]
								},
								{
									"type": "table",
									"caption": "Multiclass Spellcaster: Spell Slots per Spell Level",
									"colLabels": [
										"Lvl.",
										"1st",
										"2nd",
										"3rd",
										"4th",
										"5th",
										"6th",
										"7th",
										"8th",
										"9th"
									],
									"colStyles": [
										"col-1-2",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center",
										"col-1-2 text-center"
									],
									"rows": [
										[
											"1st",
											2,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"2nd",
											3,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"3rd",
											4,
											2,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"4th",
											4,
											3,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"5th",
											4,
											3,
											2,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"6th",
											4,
											3,
											3,
											"—",
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"7th",
											4,
											3,
											3,
											1,
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"8th",
											4,
											3,
											3,
											2,
											"—",
											"—",
											"—",
											"—",
											"—"
										],
										[
											"9th",
											4,
											3,
											3,
											3,
											1,
											"—",
											"—",
											"—",
											"—"
										],
										[
											"10th",
											4,
											3,
											3,
											3,
											2,
											"—",
											"—",
											"—",
											"—"
										],
										[
											"11th",
											4,
											3,
											3,
											3,
											2,
											1,
											"—",
											"—",
											"—"
										],
										[
											"12th",
											4,
											3,
											3,
											3,
											2,
											1,
											"—",
											"—",
											"—"
										],
										[
											"13th",
											4,
											3,
											3,
											3,
											2,
											1,
											1,
											"—",
											"—"
										],
										[
											"14th",
											4,
											3,
											3,
											3,
											2,
											1,
											1,
											"—",
											"—"
										],
										[
											"15th",
											4,
											3,
											3,
											3,
											2,
											1,
											1,
											1,
											"—"
										],
										[
											"16th",
											4,
											3,
											3,
											3,
											2,
											1,
											1,
											1,
											"—"
										],
										[
											"17th",
											4,
											3,
											3,
											3,
											2,
											1,
											1,
											1,
											1
										],
										[
											"18th",
											4,
											3,
											3,
											3,
											3,
											1,
											1,
											1,
											1
										],
										[
											"19th",
											4,
											3,
											3,
											3,
											3,
											2,
											1,
											1,
											1
										],
										[
											"20th",
											4,
											3,
											3,
											3,
											3,
											2,
											2,
											1,
											1
										]
									]
								}
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "section",
			"name": "Adamantine Weapons",
			"entries": [
				"Adamantine is an ultrahard metal found in meteorites and extraordinary mineral veins. In addition to being used to craft adamantine armor, the metal is also used for weapons.",
				"Melee weapons and ammunition made of or coated with adamantine are unusually effective when used to break objects. Whenever an {@item adamantine weapon|xge} or piece of {@item adamantine ammunition|xge|ammunition} hits an object, the hit is a critical hit.",
				"The adamantine version of a melee weapon or of ten pieces of ammunition costs 500 gp more than the normal version, whether the weapon or ammunition is made of the metal or coated with it."
			],
			"source": "PHEW"
		},
		{
			"type": "section",
			"name": "Downtime Revisited",
			"entries": [
				"It's possible for the characters to start a campaign at 1st level, dive into an epic story, and reach 10th level and beyond in a short amount of game time. Although that pace works fine for many campaigns, some DMs prefer a campaign story with pauses built into it—times when adventurers are not going on adventures. The downtime rules given in this section can be used as alternatives to the approach in the Player's Handbook and the Dungeon Master's Guide, or you can use the material here to inspire the creation of your own options.",
				"By engaging the characters in downtime activities that take weeks or even months to complete, you can give your campaign a longer time line—one in which events in the world play out over years. Wars begin and end, tyrants come and go, and royal lines rise and fall over the course of the story that you and the characters tell.",
				"Downtime rules also provide ways for characters to spend—or be relieved of—the monetary treasure they amass on their adventures.",
				"The system presented here consists of two elements. First, it introduces the concept of rivals. Second, it details a number of downtime activities that characters can undertake.",
				{
					"type": "entries",
					"name": "Rivals",
					"entries": [
						"Rivals are NPCs who oppose the characters and make their presence felt whenever the characters are engaging in downtime. A rival might be a villain you have featured in past adventures or plan to use in the future. Rivals can also include good or neutral folk who are at odds with the characters, whether because they have opposing goals or they simply dislike one another. The cultist of Orcus whose plans the characters have foiled, the ambitious merchant prince who wants to rule the city with an iron fist, and the nosy high priest of Helm who is convinced the characters are up to no good are all examples of rivals.",
						"A rival's agenda changes over time. Though the characters engage in downtime only between adventures, their rivals rarely rest, continuing to spin plots and work against the characters even when the characters are off doing something else.",
						{
							"type": "entries",
							"name": "Creating a Rival",
							"entries": [
								"In essence, a rival is a somewhat specialized NPC. You can use chapter 4 of the Dungeon Master's Guide to build a new NPC for this purpose, or pick one from your current cast of supporting characters and embellish that NPC as described below.",
								"It's possible for the characters to have two or three rivals at a time, each with a separate agenda. At least one should be a villain, but the others might be neutral or good; conflicts with those rivals might be social or political, rather than manifesting as direct attacks.",
								"The best rivals have a connection with their adversaries on a personal level. Find links in the characters' backstories or the events of recent adventures that explain what sparked the rival's actions. The best trouble to put the characters in is trouble they created for themselves.",
								{
									"type": "table",
									"caption": "Rival",
									"colLabels": [
										"d20",
										"Rival"
									],
									"colStyles": [
										"col-2 text-center",
										"col-10"
									],
									"rows": [
										[
											"1",
											"Tax collector who is convinced the characters are dodging fees"
										],
										[
											"2",
											"Politician who is concerned that the characters are causing more trouble than they solve"
										],
										[
											"3",
											"High priest who worries the characters are diminishing the temple's prestige"
										],
										[
											"4",
											"Wizard who blames the characters for some recent troubles"
										],
										[
											"5",
											"Rival adventuring party"
										],
										[
											"6",
											"Bard who loves a scandal enough to spark one"
										],
										[
											"7",
											"Childhood rival or member of a rival clan"
										],
										[
											"8",
											"Scorned sibling or parent"
										],
										[
											"9",
											"Merchant who blames the characters for any business woes"
										],
										[
											"10",
											"Newcomer out to make a mark on the world"
										],
										[
											"11",
											"Sibling or ally of defeated enemy"
										],
										[
											"12",
											"Official seeking to restore a tarnished reputation"
										],
										[
											"13",
											"Deadly foe disguised as a social rival"
										],
										[
											"14",
											"Fiend seeking to tempt the characters to evil"
										],
										[
											"15",
											"Spurned romantic interest"
										],
										[
											"16",
											"Political opportunist seeking a scapegoat"
										],
										[
											"17",
											"Traitorous noble looking to foment a revolution"
										],
										[
											"18",
											"Would-be tyrant who brooks no opposition"
										],
										[
											"19",
											"Exiled noble looking for revenge"
										],
										[
											"20",
											"Corrupt official worried that recent misdeeds will be revealed"
										]
									]
								},
								"To add the right amount of detail to a rival you want to create, give some thought to what that NPC is trying to accomplish and what resources and methods the rival can bring to bear against the characters.",
								{
									"type": "entries",
									"name": "Goals",
									"entries": [
										"An effective rival has a clear reason for interfering with the characters' lives. Think about what the rival wants, how and why the characters stand in the way, and how the conflict could be resolved. Ideally, a rival's goal directly involves the characters or something they care about."
									]
								},
								{
									"type": "entries",
									"name": "Assets",
									"entries": [
										"Think about the resources the rival can marshal. Does the character have enough money to pay bribes or to hire a small gang of mercenaries? Does the rival hold sway over any guilds, temples, or other groups? Make a list of the rival's assets, and consider how they can be used."
									]
								},
								{
									"type": "entries",
									"name": "Plans",
									"entries": [
										"The foundation of a rival's presence in the campaign is the actions the rival takes or the events that occur as a result of that character's goals. Each time you resolve one or more workweeks of downtime, pick one of the ways a rival's plans might be advanced and introduce it into play.",
										"Think about how a rival might operate in order to bring specific plans to fruition, and jot down three or four kinds of actions the rival might undertake. Some of these might be versions of the downtime activities described later in this section, but these are more often efforts that are specific to the rival.",
										"A rival's action might be a direct attack, such as an assassination attempt, that you play out during a session. Or it might be a background activity that you describe as altering the campaign in some way. For example, a rival who wants to increase the prestige of the temple of a war god might hold a festival with drink, food, and gladiatorial games. Even if the characters aren't directly involved, the event becomes the talk of the town.",
										"Some elements of a rival's plans might involve events in the world that aren't under the rival's control. Whether such an event can be easily anticipated or not, the rival's plans might include contingencies for taking advantage of such happenings."
									]
								}
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Downtime Activities",
					"entries": [
						"Downtime activities are tasks that usually take a workweek (5 days) or longer to perform. These tasks can include buying or creating magic items, pulling off crimes, and working at a job. A character selects a downtime activity from among those available and pays the cost of that activity in time and money. You, as DM, then follow the rules for the activity to resolve it, informing the player of the results and any complications that ensue.",
						"Consider handling downtime away from the game table. For example, you could have the players pick their downtime activities at the end of a session, and then communicate about them by email or text, until you next see them in person.",
						{
							"type": "entries",
							"name": "Resolving Activities",
							"entries": [
								"The description of each activity tells you how to resolve it. Many activities require an ability check, so be sure to note the character's relevant ability modifiers. Follow the steps in the activity, and determine the results.",
								"Most downtime activities require a workweek (5 days) to complete. Some activities require days, weeks (7 days), or months (30 days). A character must spend at least 8 hours of each day engaged in the downtime activity for that day to count toward the activity's completion.",
								"The days of an activity don't need to be consecutive; you can spread them over a longer period of time than is required for the activity. But that period of time should be no more than twice as long as the required time; otherwise you should introduce extra complications (see below) and possibly double the activity's costs to represent the inefficiency of the character's progress."
							]
						},
						{
							"type": "entries",
							"name": "Complications",
							"entries": [
								"The description of each activity includes a discussion of complications you can throw at the characters. The consequences of a complication might spawn entire adventures, introduce NPCs to vex the party, or give the characters headaches or advantages in any number of other ways.",
								"Each of these sections has a table that offers possible complications. You can roll to determine a complication randomly, pick one from the table, or devise one of your own, and then share it with the player."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Example Downtime Activities",
					"entries": [
						"The following activities are suitable for any character who can afford to pursue them. As DM, you have the final say on which activities are available to the characters. The activities you allow might depend on the nature of the area where the characters are located. For example, you might disallow the creation of magic items or decide that the characters are in a town that is too isolated from major markets for them to buy such items.",
						"See the following entries for details:",
						{
							"type": "list",
							"items": [
								"{@variantrule Downtime Activity; Buying a Magic Item|PHEW}",
								"{@variantrule Downtime Activity; Carousing|PHEW}",
								"{@variantrule Downtime Activity; Crafting an Item|PHEW}",
								"{@variantrule Downtime Activity; Crime|PHEW}",
								"{@variantrule Downtime Activity; Gambling|PHEW}",
								"{@variantrule Downtime Activity; Pit Fighting|PHEW}",
								"{@variantrule Downtime Activity; Relaxation|PHEW}",
								"{@variantrule Downtime Activity; Religious Service|PHEW}",
								"{@variantrule Downtime Activity; Research|PHEW}",
								"{@variantrule Downtime Activity; Scribing a Spell Scroll|PHEW}",
								"{@variantrule Downtime Activity; Selling a Magic Item|PHEW}",
								"{@variantrule Downtime Activity; Training|PHEW}",
								"{@variantrule Downtime Activity; Work|PHEW}"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Buying a Magic Item",
			"entries": [
				"Purchasing a magic item requires time and money to seek out and contact people willing to sell items. Even then, there is no guarantee a seller will have the items a character desires.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Finding magic items to purchase requires at least one workweek of effort and 100 gp in expenses. Spending more time and money increases your chance of finding a high-quality item."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"A character seeking to buy a magic item makes a Charisma (Persuasion) check to determine the quality of the seller found. The character gains a +1 bonus on the check for every workweek beyond the first that is spent seeking a seller and a +1 bonus for every additional 100 gp spent on the search, up to a maximum bonus of +10. The monetary cost includes a wealthy lifestyle, for a buyer must impress potential business partners.",
						"As shown on the Buying Magic Items table, the total of the check dictates which table in the Dungeon Master's Guide to roll on to determine which items are on the market. Or you can roll for items from any table associated with a lower total on the Buying Magic Items table. As a further option to reflect the availability of items in your campaign, you can apply a -10 penalty for low magic campaigns or a +10 bonus for high magic campaigns. Furthermore, you can double magic item costs in low magic campaigns.",
						"Using the Magic Item Price table, you then assign prices to the available items, based on their rarity. Halve the price of any consumable item, such as a potion or a scroll, when using the table to determine an asking price.",
						"You have final say in determining which items are for sale and their final price, no matter what the tables say.",
						"If the characters seek a specific magic item, first decide if it's an item you want to allow in your game. If so, include the desired item among the items for sale on a check total of 10 or higher if the item is common, 15 or higher if it is uncommon, 20 or higher if it is rare, 25 or higher if it is very rare, and 30 or higher if it is legendary."
					]
				},
				{
					"type": "table",
					"caption": "Buying Magic Items",
					"colLabels": [
						"Check Total",
						"Items Acquired"
					],
					"colStyles": [
						"col-2 text-center",
						"col-10"
					],
					"rows": [
						[
							"1—5",
							"Roll {@dice 1d6} times on {@table Magic Item Table A}."
						],
						[
							"6—10",
							"Roll {@dice 1d4} times on {@table Magic Item Table B}."
						],
						[
							"11—15",
							"Roll {@dice 1d4} times on {@table Magic Item Table C}."
						],
						[
							"16—20",
							"Roll {@dice 1d4} times on {@table Magic Item Table D}."
						],
						[
							"21—25",
							"Roll {@dice 1d4} times on {@table Magic Item Table E}."
						],
						[
							"26—30",
							"Roll {@dice 1d4} times on {@table Magic Item Table F}."
						],
						[
							"31—35",
							"Roll {@dice 1d4} times on {@table Magic Item Table G}."
						],
						[
							"36—40",
							"Roll {@dice 1d4} times on {@table Magic Item Table H}."
						],
						[
							"41+",
							"Roll {@dice 1d4} times on {@table Magic Item Table I}."
						]
					]
				},
				{
					"type": "table",
					"caption": "Magic Item Price",
					"colLabels": [
						"Rarity",
						"Asking Price*"
					],
					"colStyles": [
						"col-5",
						"col-7 text-right"
					],
					"rows": [
						[
							"Common",
							"({@dice 1d6 + 1}) × 10 gp"
						],
						[
							"Uncommon",
							"{@dice 1d6 × 100} gp"
						],
						[
							"Rare",
							"{@dice 2d10 × 1,000} gp"
						],
						[
							"Very rare",
							"({@dice 1d4 + 1}) × 10,000 gp"
						],
						[
							"Legendary",
							"{@dice 2d6 × 25,000} gp"
						]
					],
					"footnotes": [
						"*Halved for a consumable item like a potion or scroll"
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"The magic item trade is fraught with peril. The large sums of money involved and the power offered by magic items attract thieves, con artists, and other villains. If you want to make things more interesting for the characters, roll on the Magic Item Purchase Complications table or invent your own complication.",
						{
							"type": "table",
							"caption": "Magic Item Purchase Complications",
							"colLabels": [
								"d12",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"The item is a fake, planted by an enemy.*"
								],
								[
									"2",
									"The item is stolen by the party's enemies.*"
								],
								[
									"3",
									"The item is cursed by a god."
								],
								[
									"4",
									"The item's original owner will kill to reclaim it; the party's enemies spread news of its sale.*"
								],
								[
									"5",
									"The item is at the center of a dark prophecy."
								],
								[
									"6",
									"The seller is murdered before the sale.*"
								],
								[
									"7",
									"The seller is a devil looking to make a bargain."
								],
								[
									"8",
									"The item is the key to freeing an evil entity."
								],
								[
									"9",
									"A third party bids on the item, doubling its price.*"
								],
								[
									"10",
									"The item is an enslaved, intelligent entity."
								],
								[
									"11",
									"The item is tied to a cult."
								],
								[
									"12",
									"The party's enemies spread rumors that the item is an artifact of evil.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Carousing",
			"entries": [
				"Carousing is a default downtime activity for many characters. Between adventures, who doesn't want to relax with a few drinks and a group of friends at a tavern?",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Carousing covers a workweek of fine food, strong drink, and socializing. A character can attempt to carouse among lower-, middle-, or upper-class folk. A character can carouse with the lower class for 10 gp to cover expenses, or 50 gp for the middle class. Carousing with the upper class requires 250 gp for the workweek and access to the local nobility.",
						"A character with the noble background can mingle with the upper class, but other characters can do so only if you judge that the character has made sufficient contacts. Alternatively, a character might use a disguise kit and the Deception skill to pass as a noble visiting from a distant city."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"After a workweek of carousing, a character stands to make contacts within the selected social class. The character makes a Charisma (Persuasion) check using the Carousing table.",
						{
							"type": "table",
							"caption": "Carousing",
							"colLabels": [
								"Check Total",
								"Result"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1—5",
									"Character has made a hostile contact."
								],
								[
									"6—10",
									"Character has made no new contacts."
								],
								[
									"11—15",
									"Character has made an allied contact."
								],
								[
									"16—20",
									"Character has made two allied contacts."
								],
								[
									"21+",
									"Character has made three allied contacts."
								]
							]
						},
						"Contacts are NPCs who now share a bond with the character. Each one either owes the character a favor or has some reason to bear a grudge. A hostile contact works against the character, placing obstacles but stopping short of committing a crime or a violent act. Allied contacts are friends who will render aid to the character, but not at the risk of their lives.",
						"Lower-class contacts include criminals, laborers, mercenaries, the town guard, and any other folk who normally frequent the cheapest taverns in town.",
						"Middle-class contacts include guild members, spellcasters, town officials, and other folk who frequent well-kept establishments.",
						"Upper-class contacts are nobles and their personal servants. Carousing with such folk covers formal banquets, state dinners, and the like.",
						"Once a contact has helped or hindered a character, the character needs to carouse again to get back into the NPC's good graces. A contact provides help once, not help for life. The contact remains friendly, which can influence roleplaying and how the characters interact with them, but doesn't come with a guarantee of help.",
						"You can assign specific NPCs as contacts. You might decide that the barkeep at the Wretched Gorgon and a guard stationed at the western gate are the character's allied contacts. Assigning specific NPCs gives the players concrete options. It brings the campaign to life and seeds the area with NPCs that the characters care about. On the other hand, it can prove difficult to track and might render a contact useless if that character doesn't come into play.",
						"Alternatively, you can allow the player to make an NPC into a contact on the spot, after carousing. When the characters are in the area in which they caroused, a player can expend an allied contact and designate an NPC they meet as a contact, assuming the NPC is of the correct social class based on how the character caroused. The player should provide a reasonable explanation for this relationship and work it into the game.",
						"Using a mix of the two approaches is a good idea, since it gives you the added depth of specific contacts while giving players the freedom to ensure that the contacts they accumulate are useful.",
						"The same process can apply to hostile contacts. You can give the characters a specific NPC they should avoid, or you might introduce one at an inopportune or dramatic moment.",
						"At any time, a character can have a maximum number of unspecified allied contacts equal to 1 + the character's Charisma modifier (minimum of 1). Specific, named contacts don't count toward this limit—only ones that can be used at any time to declare an NPC as a contact."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Characters who carouse risk bar brawls, accumulating a cloud of nasty rumors, and building a bad reputation around town. As a rule of thumb, a character has a 10 percent chance of triggering a complication for each workweek of carousing.",
						{
							"type": "table",
							"caption": "Lower-Class Carousing Complications",
							"colLabels": [
								"d8",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"A pickpocket lifts {@dice 1d10 × 5} gp from you.*"
								],
								[
									"2",
									"A bar brawl leaves you with a scar.*"
								],
								[
									"3",
									"You have fuzzy memories of doing something very, very illegal, but can't remember exactly what."
								],
								[
									"4",
									"You are banned from a tavern after some obnoxious behavior.*"
								],
								[
									"5",
									"After a few drinks, you swore in the town square to pursue a dangerous quest."
								],
								[
									"6",
									"Surprise! You're married."
								],
								[
									"7",
									"Streaking naked through the streets seemed like a great idea at the time."
								],
								[
									"8",
									"Everyone is calling you by some weird, embarrassing nickname, like Puddle Drinker or Bench Slayer, and no one will say why.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						},
						{
							"type": "table",
							"caption": "Middle-Class Carousing Complications",
							"colLabels": [
								"d8",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You accidentally insulted a guild master, and only a public apology will let you do business with the guild again.*"
								],
								[
									"2",
									"You swore to complete some quest on behalf of a temple or a guild."
								],
								[
									"3",
									"A social gaffe has made you the talk of the town.*"
								],
								[
									"4",
									"A particularly obnoxious person has taken an intense romantic interest in you.*"
								],
								[
									"5",
									"You have made a foe out of a local spellcaster.*"
								],
								[
									"6",
									"You have been recruited to help run a local festival, play, or similar event."
								],
								[
									"7",
									"You made a drunken toast that scandalized the locals."
								],
								[
									"8",
									"You spent an additional 100 gp trying to impress people."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						},
						{
							"type": "table",
							"caption": "Upper-Class Carousing Complications",
							"colLabels": [
								"d8",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"A pushy noble family wants to marry off one of their scions to you.*"
								],
								[
									"2",
									"You tripped and fell during a dance, and people can't stop talking about it."
								],
								[
									"3",
									"You have agreed to take on a noble's debts."
								],
								[
									"4",
									"You have been challenged to a joust by a knight.*"
								],
								[
									"5",
									"You have made a foe out of a local noble.*"
								],
								[
									"6",
									"A boring noble insists you visit each day and listen to long, tedious theories of magic."
								],
								[
									"7",
									"You have become the target of a variety of embarrassing rumors.*"
								],
								[
									"8",
									"You spent an additional 500 gp trying to impress people."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Crafting an Item",
			"entries": [
				"A character who has the time, the money, and the needed tools can use downtime to craft armor, weapons, clothing, or other kinds of nonmagical gear.",
				{
					"type": "entries",
					"name": "Resources and Resolution",
					"entries": [
						"In addition to the appropriate tools for the item to be crafted, a character needs raw materials worth half of the item's selling cost. To determine how many workweeks it takes to create an item, divide its gold piece cost by 50. A character can complete multiple items in a workweek if the items' combined cost is 50 gp or lower. Items that cost more than 50 gp can be completed over longer periods of time, as long as the work in progress is stored in a safe location.",
						"Multiple characters can combine their efforts. Divide the time needed to create an item by the number of characters working on it. Use your judgment when determining how many characters can collaborate on an item. A particularly tiny item, like a ring, might allow only one or two workers, whereas a large, complex item might allow four or more workers.",
						"A character needs to be proficient with the tools needed to craft an item and have access to the appropriate equipment. Everyone who collaborates needs to have the appropriate tool proficiency. You need to make any judgment calls regarding whether a character has the correct equipment. The following table provides some examples.",
						{
							"type": "table",
							"colLabels": [
								"Proficiency",
								"Items"
							],
							"colStyles": [
								"col-6",
								"col-6"
							],
							"rows": [
								[
									"{@item Herbalism kit|phb}",
									"Antitoxin, potion of healing"
								],
								[
									"{@item Leatherworker's tools|phb}",
									"Leather armor, boots"
								],
								[
									"{@item Smith's tools|phb}",
									"Armor, weapons"
								],
								[
									"{@item Weaver's tools|phb}",
									"Cloaks, robes"
								]
							]
						},
						"If all the above requirements are met, the result of the process is an item of the desired sort. A character can sell an item crafted in this way at its listed price."
					]
				},
				{
					"type": "entries",
					"name": "Crafting Magic Items",
					"entries": [
						"Creating a magic item requires more than just time, effort, and materials. It is a long-term process that involves one or more adventures to track down rare materials and the lore needed to create the item.",
						"Potions of healing and spell scrolls are exceptions to the following rules. For more information, see \"Brewing Potions of Healing\" later in this section and the \"Scribing a Spell Scroll\" section, below.",
						"To start with, a character needs a formula for a magic item in order to create it. The formula is like a recipe. It lists the materials needed and steps required to make the item.",
						"An item invariably requires an exotic material to complete it. This material can range from the skin of a yeti to a vial of water taken from a whirlpool on the Elemental Plane of Water. Finding that material should take place as part of an adventure.",
						"The Magic Item Ingredients table suggests the challenge rating of a creature that the characters need to face to acquire the materials for an item. Note that facing a creature does not necessarily mean that the characters must collect items from its corpse. Rather, the creature might guard a location or a resource that the characters need access to.",
						{
							"type": "table",
							"caption": "Magic Item Ingredients",
							"colLabels": [
								"Item Rarity",
								"CR Range"
							],
							"colStyles": [
								"col-6",
								"col-6 text-center"
							],
							"rows": [
								[
									"Common",
									"1—3"
								],
								[
									"Uncommon",
									"4—8"
								],
								[
									"Rare",
									"9—12"
								],
								[
									"Very rare",
									"13—18"
								],
								[
									"Legendary",
									"19+"
								]
							]
						},
						"If appropriate, pick a monster or a location that is a thematic fit for the item to be crafted. For example, creating mariner's armor might require the essence of a water weird. Crafting a staff of charming might require the cooperation of a specific arcanaloth, who will help only if the characters complete a task for it. Making a staff of power might hinge on acquiring a piece of an ancient stone that was once touched by the god of magic—a stone now guarded by a suspicious androsphinx.",
						"In addition to facing a specific creature, creating an item comes with a gold piece cost covering other materials, tools, and so on, based on the item's rarity. Those values, as well as the time a character needs to work in order to complete the item, are shown on the Magic Item Crafting Time and Cost table. Halve the listed price and creation time for any consumable items.",
						{
							"type": "table",
							"caption": "Magic Item Crafting Time and Cost",
							"colLabels": [
								"Item Rarity",
								"Workweeks*",
								"Cost*"
							],
							"colStyles": [
								"col-4",
								"col-4 text-center",
								"col-4 text-right"
							],
							"rows": [
								[
									"Common",
									"1",
									"50 gp"
								],
								[
									"Uncommon",
									"2",
									"200 gp"
								],
								[
									"Rare",
									"10",
									"2,000 gp"
								],
								[
									"Very rare",
									"25",
									"20,000 gp"
								],
								[
									"Legendary",
									"50",
									"100,000 gp"
								]
							],
							"footnotes": [
								"*Halved for a consumable item like a potion or scroll"
							]
						},
						"To complete a magic item, a character also needs whatever tool proficiency is appropriate, as for crafting a nonmagical object, or proficiency in the Arcana skill.",
						"If all the above requirements are met, the result of the process is a magic item of the desired sort."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Most of the complications involved in creating something, especially a magic item, are linked to the difficulty in finding rare ingredients or components needed to complete the work. The complications a character might face as byproducts of the creation process are most interesting when the characters are working on a magic item: there's a 10 percent chance for every five workweeks spent on crafting an item that a complication occurs. The Crafting Complications table provides examples of what might happen.",
						{
							"type": "table",
							"caption": "Crafting Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"Rumors swirl that what you're working on is unstable and a threat to the community.*"
								],
								[
									"2",
									"Your tools are stolen, forcing you to buy new ones.*"
								],
								[
									"3",
									"A local wizard shows keen interest in your work and insists on observing you."
								],
								[
									"4",
									"A powerful noble offers a hefty price for your work and is not interested in hearing no for an answer.*"
								],
								[
									"5",
									"A dwarf clan accuses you of stealing its secret lore to fuel your work.*"
								],
								[
									"6",
									"A competitor spreads rumors that your work is shoddy and prone to failure.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Brewing Potions of Healing",
					"entries": [
						"Potions of healing fall into a special category for item crafting, separate from other magic items. A character who has proficiency with the herbalism kit can create these potions. The times and costs for doing so are summarized on the Potion of Healing Creation table.",
						{
							"type": "table",
							"caption": "Potion of Healing Creation",
							"colLabels": [
								"Type",
								"Time",
								"Cost"
							],
							"colStyles": [
								"col-4",
								"col-4",
								"col-4 text-right"
							],
							"rows": [
								[
									"Healing",
									"1 day",
									"25 gp"
								],
								[
									"Greater healing",
									"1 workweek",
									"100 gp"
								],
								[
									"Superior healing",
									"3 workweeks",
									"1,000 gp"
								],
								[
									"Supreme healing",
									"4 workweeks",
									"10,000 gp"
								]
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Crime",
			"entries": [
				"Sometimes it pays to be bad. This activity gives a character the chance to make some extra cash, at the risk of arrest.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"A character must spend one week and at least 25 gp gathering information on potential targets before committing the intended crime."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"The character must make a series of checks, with the DC for all the checks chosen by the character according to the amount of profit sought from the crime.",
						"The chosen DC can be 10, 15, 20, or 25. Successful completion of the crime yields a number of gold pieces, as shown on the Loot Value table.",
						"To attempt a crime, the character makes three checks: Dexterity (Stealth), Dexterity using thieves' tools, and the player's choice of Intelligence (Investigation), Wisdom (Perception), or Charisma (Deception).",
						"If none of the checks are successful, the character is caught and jailed. The character must pay a fine equal to the profit the crime would have earned and must spend one week in jail for each 25 gp of the fine.",
						"If only one check is successful, the heist fails but the character escapes.",
						"If two checks are successful, the heist is a partial success, netting the character half the payout.",
						"If all three checks are successful, the character earns the full value of the loot.",
						{
							"type": "table",
							"caption": "Loot Value",
							"colLabels": [
								"DC",
								"Value"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"10",
									"50 gp, robbery of a struggling merchant"
								],
								[
									"15",
									"100 gp, robbery of a prosperous merchant"
								],
								[
									"20",
									"200 gp, robbery of a noble"
								],
								[
									"25",
									"1,000 gp, robbery of one of the richest figures in town"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"A life of crime is filled with complications. Roll on the Crime Complications table (or create a complication of your own) if the character succeeds on only one check. If the character's rival is involved in crime or law enforcement, a complication ensues if the character succeeds on only two checks.",
						{
							"type": "table",
							"caption": "Crime Complications",
							"colLabels": [
								"d8",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"A bounty equal to your earnings is offered for information about your crime.*"
								],
								[
									"2",
									"An unknown person contacts you, threatening to reveal your crime if you don't render a service.*"
								],
								[
									"3",
									"Your victim is financially ruined by your crime."
								],
								[
									"4",
									"Someone who knows of your crime has been arrested on an unrelated matter.*"
								],
								[
									"5",
									"Your loot is a single, easily identified item that you can't fence in this region."
								],
								[
									"6",
									"You robbed someone who was under a local crime lord's protection, and who now wants revenge."
								],
								[
									"7",
									"Your victim calls in a favor from a guard, doubling the efforts to solve the case."
								],
								[
									"8",
									"Your victim asks one of your adventuring companions to solve the crime."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Gambling",
			"entries": [
				"Games of chance are a way to make a fortune—and perhaps a better way to lose one.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"This activity requires one workweek of effort plus a stake of at least 10 gp, to a maximum of 1,000 gp or more, as you see fit."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"The character must make a series of checks, with a DC determined at random based on the quality of the competition that the character runs into. Part of the risk of gambling is that one never knows who might end up sitting across the table.",
						"The character makes three checks: Wisdom (Insight), Charisma (Deception), and Charisma (Intimidation). If the character has proficiency with an appropriate gaming set, that tool proficiency can replace the relevant skill in any of the checks. The DC for each of the checks is {@dice 5 + 2d10}; generate a separate DC for each one. Consult the Gambling Results table to see how the character did.",
						{
							"type": "table",
							"caption": "Gambling Results",
							"colLabels": [
								"Result",
								"Value"
							],
							"colStyles": [
								"col-5",
								"col-7"
							],
							"rows": [
								[
									"0 successes",
									"Lose all the money you bet, and accrue a debt equal to that amount."
								],
								[
									"1 success",
									"Lose half the money you bet."
								],
								[
									"2 successes",
									"Gain the amount you bet plus half again more."
								],
								[
									"3 successes",
									"Gain double the amount you bet."
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Gambling tends to attract unsavory individuals. The potential complications involved come from run-ins with the law and associations with various criminals tied to the activity. Every workweek spent gambling brings a 10 percent chance of a complication, examples of which are on the Gambling Complications table.",
						{
							"type": "table",
							"caption": "Gambling Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You are accused of cheating. You decide whether you actually did cheat or were framed.*"
								],
								[
									"2",
									"The town guards raid the gambling hall and throw you in jail.*"
								],
								[
									"3",
									"A noble in town loses badly to you and loudly vows to get revenge.*"
								],
								[
									"4",
									"You won a sum from a low-ranking member of a thieves' guild, and the guild wants its money back."
								],
								[
									"5",
									"A local crime boss insists you start frequenting the boss's gambling parlor and no others."
								],
								[
									"6",
									"A high-stakes gambler comes to town and insists that you take part in a game."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Pit Fighting",
			"entries": [
				"Pit fighting includes boxing, wrestling, and other nonlethal forms of combat in an organized setting with predetermined matches. If you want to introduce competitive fighting in a battle-to-the-death situation, the standard combat rules apply to that sort of activity.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Engaging in this activity requires one workweek of effort from a character."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"The character must make a series of checks, with a DC determined at random based on the quality of the opposition that the character runs into. A big part of the challenge in pit fighting lies in the unknown nature of a character's opponents.",
						"The character makes three checks: Strength (Athletics), Dexterity (Acrobatics), and a special Constitution check that has a bonus equal to a roll of the character's largest Hit Die (this roll doesn't spend that die). If desired, the character can replace one of these skill checks with an attack roll using one of the character's weapons. The DC for each of the checks is {@dice 5 + 2d10}; generate a separate DC for each one. Consult the Pit Fighting Results table to see how the character did.",
						{
							"type": "table",
							"caption": "Pit Fighting Results",
							"colLabels": [
								"Result",
								"Value"
							],
							"colStyles": [
								"col-5",
								"col-7"
							],
							"rows": [
								[
									"0 successes",
									"Lose your bouts, earning nothing."
								],
								[
									"1 success",
									"Win 50 gp."
								],
								[
									"2 successes",
									"Win 100 gp."
								],
								[
									"3 successes",
									"Win 200 gp."
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Characters involved in pit fighting must deal with their opponents, the people who bet on matches, and the matches' promoters. Every workweek spent pit fighting brings a 10 percent chance of a complication, examples of which are on the Pit Fighting Complications table.",
						{
							"type": "table",
							"caption": "Pit Fighting Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"An opponent swears to take revenge on you.*"
								],
								[
									"2",
									"A crime boss approaches you and offers to pay you to intentionally lose a few matches.*"
								],
								[
									"3",
									"You defeat a popular local champion, drawing the crowd's ire."
								],
								[
									"4",
									"You defeat a noble's servant, drawing the wrath of the noble's house.*"
								],
								[
									"5",
									"You are accused of cheating. Whether the allegation is true or not, your reputation is tarnished.*"
								],
								[
									"6",
									"You accidentally deliver a near-fatal wound to a foe."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Relaxation",
			"entries": [
				"Sometimes the best thing to do between adventures is relax. Whether a character wants a hard-earned vacation or needs to recover from injuries, relaxation is the ideal option for adventurers who need a break. This option is also ideal for players who don't want to make use of the downtime system.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Relaxation requires one week. A character needs to maintain at least a modest lifestyle while relaxing to gain the benefit of the activity."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"Characters who maintain at least a modest lifestyle while relaxing gain several benefits. While relaxing, a character gains advantage on saving throws to recover from long-acting diseases and poisons. In addition, at the end of the week, a character can end one effect that keeps the character from regaining hit points, or can restore one ability score that has been reduced to less than its normal value. This benefit cannot be used if the harmful effect was caused by a spell or some other magical effect with an ongoing duration."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Relaxation rarely comes with complications. If you want to make life complicated for the characters, introduce an action or an event connected to a rival."
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Religious Service",
			"entries": [
				"Characters with a religious bent might want to spend downtime in service to a temple, either by attending rites or by proselytizing in the community. Someone who undertakes this activity has a chance of winning the favor of the temple's leaders.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Performing religious service requires access to, and often attendance at, a temple whose beliefs and ethos align with the character's. If such a place is available, the activity takes one workweek of time but involves no gold piece expenditure."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"At the end of the required time, the character chooses to make either an Intelligence (Religion) check or a Charisma (Persuasion) check. The total of the check determines the benefits of service, as shown on the Religious Service table.",
						{
							"type": "table",
							"caption": "Religious Service",
							"colLabels": [
								"Check Total",
								"Result"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1—10",
									"No effect. Your efforts fail to make a lasting impression."
								],
								[
									"11—20",
									"You earn one favor."
								],
								[
									"21+",
									"You earn two favors."
								]
							]
						},
						"A favor, in broad terms, is a promise of future assistance from a representative of the temple. It can be expended to ask the temple for help in dealing with a specific problem, for general political or social support, or to reduce the cost of cleric spellcasting by 50 percent. A favor could also take the form of a deity's intervention, such as an omen, a vision, or a minor miracle provided at a key moment. This latter sort of favor is expended by the DM, who also determines its nature.",
						"Favors earned need not be expended immediately, but only a certain number can be stored up. A character can have a maximum number of unused favors equal to 1 + the character's Charisma modifier (minimum of one unused favor)."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Temples can be labyrinths of political and social scheming. Even the best-intentioned sect can fall prone to rivalries. A character who serves a temple risks becoming embroiled in such struggles. Every workweek spent in religious service brings a 10 percent chance of a complication, examples of which are on the Religious Service Complications table.",
						{
							"type": "table",
							"caption": "Religious Service Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You have offended a priest through your words or actions.*"
								],
								[
									"2",
									"Blasphemy is still blasphemy, even if you did it by accident."
								],
								[
									"3",
									"A secret sect in the temple offers you membership."
								],
								[
									"4",
									"Another temple tries to recruit you as a spy.*"
								],
								[
									"5",
									"The temple elders implore you to take up a holy quest."
								],
								[
									"6",
									"You accidentally discover that an important person in the temple is a fiend worshiper."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Research",
			"entries": [
				"Forewarned is forearmed. The research downtime activity allows a character to delve into lore concerning a monster, a location, a magic item, or some other particular topic.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Typically, a character needs access to a library or a sage to conduct research. Assuming such access is available, conducting research requires one workweek of effort and at least 50 gp spent on materials, bribes, gifts, and other expenses."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"The character declares the focus of the research—a specific person, place, or thing. After one workweek, the character makes an Intelligence check with a +1 bonus per 100 gp spent beyond the initial 100 gp, to a maximum of +6. In addition, a character who has access to a particularly well-stocked library or knowledgeable sages gains advantage on this check. Determine how much lore a character learns using the Research Outcomes table.",
						{
							"type": "table",
							"caption": "Research Outcomes",
							"colLabels": [
								"Check Total",
								"Outcome"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1—5",
									"No effect."
								],
								[
									"6—10",
									"You learn one piece of lore."
								],
								[
									"11—20",
									"You learn two pieces of lore."
								],
								[
									"21+",
									"You learn three pieces of lore."
								]
							]
						},
						"Each piece of lore is the equivalent of one true statement about a person, place, or thing. Examples include knowledge of a creature's resistances, the password needed to enter a sealed dungeon level, the spells commonly prepared by an order of wizards, and so on.",
						"As DM, you are the final arbiter concerning exactly what a character learns. For a monster or an NPC, you can reveal elements of statistics or personality. For a location, you can reveal secrets about it, such as a hidden entrance, the answer to a riddle, or the nature of a creature that guards the place."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"The greatest risk in research is uncovering false information. Not all lore is accurate or truthful, and a rival with a scholarly bent might try to lead the character astray, especially if the object of the research is known to the rival. The rival might plant false information, bribe sages to give bad advice, or steal key tomes needed to find the truth.",
						"In addition, a character might run into other complications during research. Every workweek spent in research brings a 10 percent chance of a complication, examples of which are on the Research Complications table.",
						{
							"type": "table",
							"caption": "Research Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You accidentally damage a rare book."
								],
								[
									"2",
									"You offend a sage, who demands an extravagant gift.*"
								],
								[
									"3",
									"If you had known that book was cursed, you never would have opened it."
								],
								[
									"4",
									"A sage becomes obsessed with convincing you of a number of strange theories about reality.*"
								],
								[
									"5",
									"Your actions cause you to be banned from a library until you make reparations.*"
								],
								[
									"6",
									"You uncovered useful lore, but only by promising to complete a dangerous task in return."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Scribing a Spell Scroll",
			"entries": [
				"With time and patience, a spellcaster can transfer a spell to a scroll, creating a spell scroll.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Scribing a spell scroll takes an amount of time and money related to the level of the spell the character wants to scribe, as shown in the Spell Scroll Costs table. In addition, the character must have proficiency in the Arcana skill and must provide any material components required for the casting of the spell. Moreover, the character must have the spell prepared, or it must be among the character's known spells, in order to scribe a scroll of that spell.",
						"If the scribed spell is a cantrip, the version on the scroll works as if the caster were 1st level.",
						{
							"type": "table",
							"caption": "Spell Scroll Costs",
							"colLabels": [
								"Spell Level",
								"Time",
								"Cost"
							],
							"colStyles": [
								"col-4 text-center",
								"col-4",
								"col-4 text-right"
							],
							"rows": [
								[
									"Cantrip",
									"1 day",
									"15 gp"
								],
								[
									"1st",
									"1 day",
									"25 gp"
								],
								[
									"2nd",
									"3 days",
									"250 gp"
								],
								[
									"3rd",
									"1 workweek",
									"500 gp"
								],
								[
									"4th",
									"2 workweeks",
									"2,500 gp"
								],
								[
									"5th",
									"4 workweeks",
									"5,000 gp"
								],
								[
									"6th",
									"8 workweeks",
									"15,000 gp"
								],
								[
									"7th",
									"16 workweeks",
									"25,000 gp"
								],
								[
									"8th",
									"32 workweeks",
									"50,000 gp"
								],
								[
									"9th",
									"48 workweeks",
									"250,000 gp"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Crafting a spell scroll is a solitary task, unlikely to attract much attention. The complications that arise are more likely to involve the preparation needed for the activity. Every workweek spent scribing brings a 10 percent chance of a complication, examples of which are on the Scribe a Scroll Complications table.",
						{
							"type": "table",
							"caption": "Scribe a Scroll Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You bought up the last of the rare ink used to craft scrolls, angering a wizard in town."
								],
								[
									"2",
									"The priest of a temple of good accuses you of trafficking in dark magic.*"
								],
								[
									"3",
									"A wizard eager to collect one of your spells in a book presses you to sell the scroll."
								],
								[
									"4",
									"Due to a strange error in creating the scroll, it is instead a random spell of the same level."
								],
								[
									"5",
									"The rare parchment you bought for your scroll has a barely visible map on it."
								],
								[
									"6",
									"A thief attempts to break into your workroom.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Selling a Magic Item",
			"entries": [
				"Selling a magic item is by no means an easy task. Con artists and thieves are always looking out for an easy score, and there's no guarantee that a character will receive a good offer even if a legitimate buyer is found.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"A character can find a buyer for one magic item by spending one workweek and 25 gp, which is used to spread word of the desired sale. A character must pick one item at a time to sell."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"A character who wants to sell an item must make a Charisma (Persuasion) check to determine what kind of offer comes in. The character can always opt not to sell, instead forfeiting the workweek of effort and trying again later. Use the Magic Item Base Prices and Magic Item Offer tables to determine the sale price.",
						{
							"type": "table",
							"caption": "Magic Item Base Prices",
							"colLabels": [
								"Rarity",
								"Base Price*"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"Common",
									"100 gp"
								],
								[
									"Uncommon",
									"400 gp"
								],
								[
									"Rare",
									"4,000 gp"
								],
								[
									"Very rare",
									"40,000 gp"
								],
								[
									"Legendary",
									"200,000 gp"
								]
							],
							"footnotes": [
								"*Halved for a consumable item like a potion or scroll"
							]
						},
						{
							"type": "table",
							"caption": "Magic Item Offer",
							"colLabels": [
								"Check Total",
								"Offer"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1—10",
									"50% of base price"
								],
								[
									"11—20",
									"100% of base price"
								],
								[
									"21+",
									"150% of base price"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"The main risk in selling a magic item lies in attracting thieves and anyone else who wants the item but doesn't want to pay for it. Other folk might try to undermine a deal in order to bolster their own business or seek to discredit the character as a legitimate seller. Every workweek spent trying to sell an item brings a 10 percent chance of a complication, examples of which are on the Magic Item Sale Complications table.",
						{
							"type": "table",
							"caption": "Magic Item Sale Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"Your enemy secretly arranges to buy the item to use it against you.*"
								],
								[
									"2",
									"A thieves' guild, alerted to the sale, attempts to steal your item.*"
								],
								[
									"3",
									"A foe circulates rumors that your item is a fake.*"
								],
								[
									"4",
									"A sorcerer claims your item as a birthright and demands you hand it over."
								],
								[
									"5",
									"Your item's previous owner, or surviving allies of the owner, vow to retake the item by force."
								],
								[
									"6",
									"The buyer is murdered before the sale is finalized.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Training",
			"entries": [
				"Given enough free time and the services of an instructor, a character can learn a language or pick up proficiency with a tool.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Receiving training in a language or tool typically takes at least ten workweeks, but this time is reduced by a number of workweeks equal to the character's Intelligence modifier (an Intelligence penalty doesn't increase the time needed). Training costs 25 gp per workweek."
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Complications that arise while training typically involve the teacher. Every ten workweeks spent in training brings a 10 percent chance of a complication, examples of which are on the Training Complications table.",
						{
							"type": "table",
							"caption": "Training Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"Your instructor disappears, forcing you to spend one workweek finding a new one.*"
								],
								[
									"2",
									"Your teacher instructs you in rare, archaic methods, which draw comments from others."
								],
								[
									"3",
									"Your teacher is a spy sent to learn your plans.*"
								],
								[
									"4",
									"Your teacher is a wanted criminal."
								],
								[
									"5",
									"Your teacher is a cruel taskmaster."
								],
								[
									"6",
									"Your teacher asks for help dealing with a threat."
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
			"type": "entries",
			"name": "Downtime Activity; Work",
			"entries": [
				"When all else fails, an adventurer can turn to an honest trade to earn a living. This activity represents a character's attempt to find temporary work, the quality and wages of which are difficult to predict.",
				{
					"type": "entries",
					"name": "Resources",
					"entries": [
						"Performing a job requires one workweek of effort."
					]
				},
				{
					"type": "entries",
					"name": "Resolution",
					"entries": [
						"To determine how much money a character earns, the character makes an ability check: Strength (Athletics), Dexterity (Acrobatics), Intelligence using a set of tools, Charisma (Performance), or Charisma using a musical instrument. Consult the Wages table to see how much money is generated according to the total of the check.",
						{
							"type": "table",
							"caption": "Wages",
							"colLabels": [
								"Check Total",
								"Earnings"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"9 or lower",
									"Poor lifestyle for the week"
								],
								[
									"10—14",
									"Modest lifestyle for the week"
								],
								[
									"15—20",
									"Comfortable lifestyle for the week"
								],
								[
									"21+",
									"Comfortable lifestyle for the week + 25 gp"
								]
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Complications",
					"entries": [
						"Ordinary work is rarely filled with significant complications. Still, the Work Complications table can add some difficulties to a worker's life. Each workweek of activity brings a 10 percent chance that a character encounters a complication.",
						{
							"type": "table",
							"caption": "Work Complications",
							"colLabels": [
								"d6",
								"Complication"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"A difficult customer or a fight with a coworker reduces the wages you earn by one category.*"
								],
								[
									"2",
									"Your employer's financial difficulties result in your not being paid.*"
								],
								[
									"3",
									"A coworker with ties to an important family in town takes a dislike to you.*"
								],
								[
									"4",
									"Your employer is involved with a dark cult or a criminal enterprise."
								],
								[
									"5",
									"A crime ring targets your business for extortion.*"
								],
								[
									"6",
									"You gain a reputation for laziness (unjustified or not, as you choose), giving you disadvantage on checks made for this downtime activity for the next six workweeks you devote to it.*"
								]
							],
							"footnotes": [
								"*Might involve a rival"
							]
						}
					]
				}
			],
			"source": "PHEW"
		},
		{
		
			"name": "Diagonals",
			"source": "PHEW",
			"ruleType": "O",
			"entries": [
				"The {@i Player's Handbook} presents a simple method for counting movement and measuring range on a grid: count every square as 5 feet, even if you're moving diagonally. Though this is fast in play, it breaks the laws of geometry and is inaccurate over long distances. This optional rule provides more realism, but it requires more effort during combat.",
				"When measuring range or moving diagonally on a grid, the first diagonal square counts as 5 feet, but the second diagonal square counts as 10 feet. This pattern of 5 feet and then 10 feet continues whenever you're counting diagonally, even if you move horizontally or vertically between different bits of diagonal movement.",
				"For example, a character might move one square diagonally (5 feet), then three squares straight (15 feet), and then another square diagonally (10 feet) for a total movement of 30 feet."
			]
		}
	]
}
